[Survived] ArrayDeclaration
src/Parser/SimpleGDFParser/SimpleGDFParser.ts:9:20
 // This parser is very rudimental and assumes alot
 export class SimpleGDFParser implements IStringParser<Graph<NamedVertex, DirectedEdge<NamedVertex>>> {
 	currentMode: 'none' | 'nodedef' | 'edgedef' = 'none';
-	lines: string[] = [];
+	lines: string[] = ["Stryker was here"];
 	currentGraph: Graph<any, any> = new Graph<NamedVertex, DirectedEdge<NamedVertex>>();
 

[Killed] ConditionalExpression
src/Parser/SimpleGDFParser/SimpleGDFParser.ts:27:7
 			return null;
 		}
 
-		if (nextLine.startsWith('nodedef')) {
+		if (false) {
 			this.currentMode = 'nodedef';
 			return this.parseNextStep();
killedBy: g.getSubgraph(vs) Normal Cases All passed vertices are contained
statusReason: Error: Vertex {"name":"a"} not found in graph.

[Killed] ConditionalExpression
src/Parser/SimpleGDFParser/SimpleGDFParser.ts:32:7
 			return this.parseNextStep();
 		}
 
-		if (nextLine.startsWith('edgedef')) {
+		if (false) {
 			this.currentMode = 'edgedef';
 			return this.parseNextStep();
killedBy: g.getSubgraph(vs) Normal Cases Edges which had both vertices passed are contained
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 42
+ Received  +  1

- Array [
-   DirectedEdge {
-     "vertexA": NamedVertex {

[Killed] EqualityOperator
src/Parser/SimpleGDFParser/SimpleGDFParser.ts:37:7
 			return this.parseNextStep();
 		}
 
-		if (this.currentMode === 'nodedef') {
+		if (this.currentMode !== 'nodedef') {
 			const vertexName = nextLine.trim();
 			this.currentGraph.addVertex(new NamedVertex(vertexName));
killedBy: SimpleGDFParser Loads peterson graph
statusReason: Error: Vertex {"name":"a"} not found in graph.

[Killed] BlockStatement
src/Parser/SimpleGDFParser/SimpleGDFParser.ts:37:39
 			return this.parseNextStep();
 		}
 
-		if (this.currentMode === 'nodedef') {
-			const vertexName = nextLine.trim();
-			this.currentGraph.addVertex(new NamedVertex(vertexName));
-		}
+		if (this.currentMode === 'nodedef') {}
 
 		if (this.currentMode === 'edgedef') {
killedBy: SimpleGDFParser Loads peterson graph
statusReason: Error: Vertex {"name":"a"} not found in graph.

[Killed] StringLiteral
src/Parser/SimpleGDFParser/SimpleGDFParser.ts:43:54
 		}
 
 		if (this.currentMode === 'edgedef') {
-			const [vertexNameA, vertexNameB] = nextLine.split(',');
+			const [vertexNameA, vertexNameB] = nextLine.split("");
 			this.currentGraph.addEdge(new DirectedEdge(new NamedVertex(vertexNameA), new NamedVertex(vertexNameB)));
 		}
killedBy: SimpleGDFParser Loads peterson graph
statusReason: Error: Vertex {"name":","} not found in graph.
