[NoCoverage] BlockStatement
models/Edge/DirectedEdge/DirectedEdge.ts:6:16
 import { Hashable } from '@tgillespie/hash-data-structures';
 
 export class DirectedEdge<V extends Vertex> extends Edge<V> {
-	get from(): V {
-		return this.vertexA;
-	}
+	get from(): V {}
 
 	get to(): V {

[Killed] BlockStatement
models/Edge/DirectedEdge/DirectedEdge.ts:18:35
 		return true;
 	}
 
-	equals(other: Hashable): boolean {
-		if (!(other instanceof DirectedEdge)) return false;
-		if (!other.isDirected()) return false;
-
-		return this.vertexA.equals(other.vertexA) && this.vertexB.equals(other.vertexB);
-	}
+	equals(other: Hashable): boolean {}
 
 	hashCode(): number {
killedBy: DirectedEdge keeps Hashable Contract
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "The following object violated the reflexivity contract property of equals:·
{
	\"vertexA\": {
		\"name\": \"a\"
	},

[Killed] BooleanLiteral
models/Edge/DirectedEdge/DirectedEdge.ts:19:7
 	}
 
 	equals(other: Hashable): boolean {
-		if (!(other instanceof DirectedEdge)) return false;
+		if (other instanceof DirectedEdge) return false;
 		if (!other.isDirected()) return false;
 
killedBy: DirectedEdge keeps Hashable Contract
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "The following object violated the reflexivity contract property of equals:·
{
	\"vertexA\": {
		\"name\": \"a\"
	},

[Killed] ConditionalExpression
models/Edge/DirectedEdge/DirectedEdge.ts:20:7
 
 	equals(other: Hashable): boolean {
 		if (!(other instanceof DirectedEdge)) return false;
-		if (!other.isDirected()) return false;
+		if (true) return false;
 
 		return this.vertexA.equals(other.vertexA) && this.vertexB.equals(other.vertexB);
killedBy: graph.deleteVertex(v) directed edges edge list is correct removes the edge a -> b and receives the correct edge count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] BooleanLiteral
models/Edge/DirectedEdge/DirectedEdge.ts:20:7
 
 	equals(other: Hashable): boolean {
 		if (!(other instanceof DirectedEdge)) return false;
-		if (!other.isDirected()) return false;
+		if (other.isDirected()) return false;
 
 		return this.vertexA.equals(other.vertexA) && this.vertexB.equals(other.vertexB);
killedBy: graph.deleteVertex(v) directed edges edge list is correct removes the edge a -> b and receives the correct edge count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] ConditionalExpression
models/Edge/DirectedEdge/DirectedEdge.ts:22:10
 		if (!(other instanceof DirectedEdge)) return false;
 		if (!other.isDirected()) return false;
 
-		return this.vertexA.equals(other.vertexA) && this.vertexB.equals(other.vertexB);
+		return true;
 	}
 
killedBy: graph.deleteVertex(v) directed edges edge list is correct removes the edge a -> b and receives the correct edge count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0
