[Killed] BlockStatement
models/Edge/UndirectedEdge/UndirectedEdge.ts:6:24
 import { Hashable } from '@tgillespie/hash-data-structures';
 
 export class UndirectedEdge<V extends Vertex> extends Edge<V> {
-	isDirected(): boolean {
-		return false;
-	}
+	isDirected(): boolean {}
 
 	equals(other: Hashable): boolean {
killedBy: UndirectedEdge states that it is undirected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] BlockStatement
models/Edge/UndirectedEdge/UndirectedEdge.ts:10:35
 		return false;
 	}
 
-	equals(other: Hashable): boolean {
-		if (!(other instanceof UndirectedEdge)) return false;
-		if (other.isDirected()) return false;
-
-		return (
-			(this.vertexA.equals(other.vertexA) && this.vertexB.equals(other.vertexB)) ||
-			(this.vertexA.equals(other.vertexB) && this.vertexB.equals(other.vertexA))
-		);
-	}
+	equals(other: Hashable): boolean {}
 
 	hashCode(): number {
killedBy: graph.deleteVertex(v) undirected edges edge list is correct removes the edge a <-> b and receives the correct edge count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] ConditionalExpression
models/Edge/UndirectedEdge/UndirectedEdge.ts:11:7
 	}
 
 	equals(other: Hashable): boolean {
-		if (!(other instanceof UndirectedEdge)) return false;
+		if (true) return false;
 		if (other.isDirected()) return false;
 
killedBy: graph.deleteVertex(v) undirected edges edge list is correct removes the edge a <-> b and receives the correct edge count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] ConditionalExpression
models/Edge/UndirectedEdge/UndirectedEdge.ts:12:7
 
 	equals(other: Hashable): boolean {
 		if (!(other instanceof UndirectedEdge)) return false;
-		if (other.isDirected()) return false;
+		if (true) return false;
 
 		return (
killedBy: graph.deleteVertex(v) undirected edges edge list is correct removes the edge a <-> b and receives the correct edge count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Survived] ConditionalExpression
models/Edge/UndirectedEdge/UndirectedEdge.ts:12:7
 
 	equals(other: Hashable): boolean {
 		if (!(other instanceof UndirectedEdge)) return false;
-		if (other.isDirected()) return false;
+		if (false) return false;
 
 		return (

[Killed] LogicalOperator
models/Edge/UndirectedEdge/UndirectedEdge.ts:15:4
 		if (other.isDirected()) return false;
 
 		return (
-			(this.vertexA.equals(other.vertexA) && this.vertexB.equals(other.vertexB)) ||
-			(this.vertexA.equals(other.vertexB) && this.vertexB.equals(other.vertexA))
+			this.vertexA.equals(other.vertexA) && this.vertexB.equals(other.vertexB) && this.vertexA.equals(other.vertexB) && this.vertexB.equals(other.vertexA)
 		);
 	}
killedBy: graph.deleteVertex(v) undirected edges edge list is correct removes the edge a <-> b and receives the correct edge count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] ConditionalExpression
models/Edge/UndirectedEdge/UndirectedEdge.ts:15:4
 		if (other.isDirected()) return false;
 
 		return (
-			(this.vertexA.equals(other.vertexA) && this.vertexB.equals(other.vertexB)) ||
-			(this.vertexA.equals(other.vertexB) && this.vertexB.equals(other.vertexA))
+			true
 		);
 	}
killedBy: graph.deleteVertex(v) undirected edges removing non-existent edges all at once changes nothing
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 26

- Array []
+ Array [
+   DirectedEdge {
