[Killed] BlockStatement
src/models/Graph/Graph.ts:50:41
 	 *
 	 * @param vertex The vertex / vertices to be added. Duplicates are only processed once.
 	 */
-	addVertex(...vertex: V[]): Graph<V, E> {
-		const uniqueVertices = new MutableHashSet<V>();
-		const setOfGraphVertices = new MutableHashSet<V>();
-
-		vertex.forEach((x) => uniqueVertices.add(x));
-		this._listOfVertices.forEach((x) => setOfGraphVertices.add(x));
-
-		const filteredVertices = uniqueVertices.difference(setOfGraphVertices).toArray();
-
-		filteredVertices.forEach((singleVertex) => {
-			this._listOfVertices.push(singleVertex);
-			this._adjacencyList.initVertex(singleVertex);
-		});
-
-		return this;
-	}
+	addVertex(...vertex: V[]): Graph<V, E> {}
 
 	/**
killedBy: g.getStronglyConnectedComponent() Normal Cases Works with directed edges
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

- Array [
-   Array [
-     NamedVertex {

[Killed] BlockStatement
src/models/Graph/Graph.ts:59:46
 
 		const filteredVertices = uniqueVertices.difference(setOfGraphVertices).toArray();
 
-		filteredVertices.forEach((singleVertex) => {
-			this._listOfVertices.push(singleVertex);
-			this._adjacencyList.initVertex(singleVertex);
-		});
+		filteredVertices.forEach((singleVertex) => {});
 
 		return this;
killedBy: graph.deleteVertex(v) directed edges graph is initially as expected
statusReason: Error: Vertex {"name":"a"} not found in graph.

[Killed] BlockStatement
src/models/Graph/Graph.ts:73:44
 	 *
 	 * @param vertex The vertex / vertices to be removed. Duplicates are only processed once.
 	 */
-	deleteVertex(...vertex: V[]): Graph<V, E> {
-		const uniqueVertices = new MutableHashSet<V>();
-		const setOfGraphVertices = new MutableHashSet<V>();
-
-		vertex.forEach((x) => uniqueVertices.add(x));
-		this._listOfVertices.forEach((x) => setOfGraphVertices.add(x));
-
-		const filteredVertices = uniqueVertices.intersection(setOfGraphVertices).toArray();
-		filteredVertices.forEach((singleVertex) => {
-			this._listOfVertices = this._listOfVertices.filter((x) => !x.equals(singleVertex));
-			this._listOfEdges = this._listOfEdges.filter(
-				(x) => !x.vertexA.equals(singleVertex) && !x.vertexB.equals(singleVertex),
-			);
-
-			this._adjacencyMatrix.deleteVertex(singleVertex);
-
-			this._adjacencyList.deleteVertex(singleVertex);
-		});
-
-		return this;
-	}
+	deleteVertex(...vertex: V[]): Graph<V, E> {}
 
 	/**
killedBy: graph.deleteVertex(v) vertex list is correct removes the vertex a from the vertex list
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 4

[Killed] BlockStatement
src/models/Graph/Graph.ts:81:46
 		this._listOfVertices.forEach((x) => setOfGraphVertices.add(x));
 
 		const filteredVertices = uniqueVertices.intersection(setOfGraphVertices).toArray();
-		filteredVertices.forEach((singleVertex) => {
-			this._listOfVertices = this._listOfVertices.filter((x) => !x.equals(singleVertex));
-			this._listOfEdges = this._listOfEdges.filter(
-				(x) => !x.vertexA.equals(singleVertex) && !x.vertexB.equals(singleVertex),
-			);
-
-			this._adjacencyMatrix.deleteVertex(singleVertex);
-
-			this._adjacencyList.deleteVertex(singleVertex);
-		});
+		filteredVertices.forEach((singleVertex) => {});
 
 		return this;
killedBy: graph.deleteVertex(v) vertex list is correct removes the vertex a from the vertex list
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 4

[Killed] ConditionalExpression
src/models/Graph/Graph.ts:84:12
 		filteredVertices.forEach((singleVertex) => {
 			this._listOfVertices = this._listOfVertices.filter((x) => !x.equals(singleVertex));
 			this._listOfEdges = this._listOfEdges.filter(
-				(x) => !x.vertexA.equals(singleVertex) && !x.vertexB.equals(singleVertex),
+				(x) => false,
 			);
 
killedBy: graph.deleteVertex(v) edge list is correct removes the vertex a and receives the correct edge count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArrowFunction
src/models/Graph/Graph.ts:84:5
 		filteredVertices.forEach((singleVertex) => {
 			this._listOfVertices = this._listOfVertices.filter((x) => !x.equals(singleVertex));
 			this._listOfEdges = this._listOfEdges.filter(
-				(x) => !x.vertexA.equals(singleVertex) && !x.vertexB.equals(singleVertex),
+				() => undefined,
 			);
 
killedBy: graph.deleteVertex(v) edge list is correct removes the vertex a and receives the correct edge count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BooleanLiteral
src/models/Graph/Graph.ts:123:8
 			this._adjacencyMatrix.set(singleEdge.vertexA, singleEdge.vertexB, true);
 			this._adjacencyList.addAdjacency(singleEdge.vertexA, singleEdge.vertexB);
 
-			if (!singleEdge.isDirected()) {
+			if (singleEdge.isDirected()) {
 				this._adjacencyMatrix.set(singleEdge.vertexB, singleEdge.vertexA, true);
 			}
killedBy: g.addEdge() Normal Cases Adding an directed edge updates the adjacency matrix asymmetrically
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/models/Graph/Graph.ts:137:40
 	 *
 	 * @param edge The edge / edges to be removed. Duplicates are only processed once.
 	 */
-	deleteEdge(...edge: E[]): Graph<V, E> {
-		const uniqueEdges = new MutableHashSet<E>();
-		const setOfGraphEdges = new MutableHashSet<E>();
-
-		edge.forEach((x) => uniqueEdges.add(x));
-		this._listOfEdges.forEach((x) => setOfGraphEdges.add(x));
-
-		const filteredEdges = uniqueEdges.intersection(setOfGraphEdges).toArray();
-		filteredEdges.forEach((singleEdge) => {
-			this._listOfEdges = this._listOfEdges.filter((x) => !x.equals(singleEdge));
-
-			this._adjacencyMatrix.set(singleEdge.vertexA, singleEdge.vertexB, false);
-			if (!singleEdge.isDirected()) {
-				this._adjacencyMatrix.set(singleEdge.vertexB, singleEdge.vertexA, false);
-			}
-			this._adjacencyList.deleteEdge(singleEdge);
-		});
-
-		return this;
-	}
+	deleteEdge(...edge: E[]): Graph<V, E> {}
 
 	/**
killedBy: graph.deleteVertex(v) directed edges edge list is correct removes the edge a -> b and receives the correct edge count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] BlockStatement
src/models/Graph/Graph.ts:145:41
 		this._listOfEdges.forEach((x) => setOfGraphEdges.add(x));
 
 		const filteredEdges = uniqueEdges.intersection(setOfGraphEdges).toArray();
-		filteredEdges.forEach((singleEdge) => {
-			this._listOfEdges = this._listOfEdges.filter((x) => !x.equals(singleEdge));
-
-			this._adjacencyMatrix.set(singleEdge.vertexA, singleEdge.vertexB, false);
-			if (!singleEdge.isDirected()) {
-				this._adjacencyMatrix.set(singleEdge.vertexB, singleEdge.vertexA, false);
-			}
-			this._adjacencyList.deleteEdge(singleEdge);
-		});
+		filteredEdges.forEach((singleEdge) => {});
 
 		return this;
killedBy: graph.deleteVertex(v) directed edges edge list is correct removes the edge a -> b and receives the correct edge count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] BooleanLiteral
src/models/Graph/Graph.ts:148:70
 		filteredEdges.forEach((singleEdge) => {
 			this._listOfEdges = this._listOfEdges.filter((x) => !x.equals(singleEdge));
 
-			this._adjacencyMatrix.set(singleEdge.vertexA, singleEdge.vertexB, false);
+			this._adjacencyMatrix.set(singleEdge.vertexA, singleEdge.vertexB, true);
 			if (!singleEdge.isDirected()) {
 				this._adjacencyMatrix.set(singleEdge.vertexB, singleEdge.vertexA, false);
killedBy: graph.deleteVertex(v) directed edges adjacencyMatrix is correct removes the edge a -> b and sets the deleted edge to false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/models/Graph/Graph.ts:149:34
 			this._listOfEdges = this._listOfEdges.filter((x) => !x.equals(singleEdge));
 
 			this._adjacencyMatrix.set(singleEdge.vertexA, singleEdge.vertexB, false);
-			if (!singleEdge.isDirected()) {
-				this._adjacencyMatrix.set(singleEdge.vertexB, singleEdge.vertexA, false);
-			}
+			if (!singleEdge.isDirected()) {}
 			this._adjacencyList.deleteEdge(singleEdge);
 		});
killedBy: graph.deleteVertex(v) undirected edges adjacencyMatrix is correct removes the edge a <-> b and sets the deleted edge to false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/models/Graph/Graph.ts:149:8
 			this._listOfEdges = this._listOfEdges.filter((x) => !x.equals(singleEdge));
 
 			this._adjacencyMatrix.set(singleEdge.vertexA, singleEdge.vertexB, false);
-			if (!singleEdge.isDirected()) {
+			if (false) {
 				this._adjacencyMatrix.set(singleEdge.vertexB, singleEdge.vertexA, false);
 			}
killedBy: graph.deleteVertex(v) undirected edges adjacencyMatrix is correct removes the edge a <-> b and sets the deleted edge to false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/models/Graph/Graph.ts:150:71
 
 			this._adjacencyMatrix.set(singleEdge.vertexA, singleEdge.vertexB, false);
 			if (!singleEdge.isDirected()) {
-				this._adjacencyMatrix.set(singleEdge.vertexB, singleEdge.vertexA, false);
+				this._adjacencyMatrix.set(singleEdge.vertexB, singleEdge.vertexA, true);
 			}
 			this._adjacencyList.deleteEdge(singleEdge);
killedBy: graph.deleteVertex(v) undirected edges adjacencyMatrix is correct removes the edge a <-> b and sets the deleted edge to false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] EqualityOperator
src/models/Graph/Graph.ts:179:7
 
 		// ToDo: Possible optimization: just return adjacency list for the node if graph is undirected (keep track with a property)
 
-		if (allEdges.length >= allVertices.length) {
+		if (allEdges.length > allVertices.length) {
 			const adjacencyMatrix = this.getAdjacencyMatrix();
 			result = allVertices.filter((maybeChild) => {

[Killed] ConditionalExpression
src/models/Graph/Graph.ts:188:9
 			allEdges.forEach((singleEdge) => {
 				if (singleEdge.vertexA.equals(vertex)) result.push(singleEdge.vertexB);
 
-				if (!singleEdge.isDirected() && singleEdge.vertexB.equals(vertex)) result.push(singleEdge.vertexA);
+				if (false) result.push(singleEdge.vertexA);
 			});
 		}
killedBy: g.*dfsIterator() Normal Case Works for undirected graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -7,11 +7,11 @@
    },
    NamedVertex {

[Killed] ConditionalExpression
src/models/Graph/Graph.ts:205:11
 	 */
 	getAttachedEdges(vertex: V): E[] {
 		return this.getListOfEdges().filter(({ vertexA, vertexB }) => {
-			return vertexA.equals(vertex) || vertexB.equals(vertex);
+			return true;
 		});
 	}
killedBy: Test retrieving attached, incoming and outgoing edges for a vertex g.getAttachedEdges(v) works with a directed graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 40

@@ -1,8 +1,16 @@
  Array [
    DirectedEdge {

[Killed] BlockStatement
src/models/Graph/Graph.ts:233:22
 	 */
 	getIncomingEdges(vertex: V): E[] {
 		return this.getListOfEdges().filter(({ vertexA, vertexB, isDirected }) => {
-			if (isDirected()) {
-				return vertexB.equals(vertex);
-			}
+			if (isDirected()) {}
 
 			return vertexA.equals(vertex) || vertexB.equals(vertex);
killedBy: Test retrieving attached, incoming and outgoing edges for a vertex g.getIncomingEdges(v) works with a directed graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 16

@@ -2,10 +2,26 @@
    DirectedEdge {
      "vertexA": NamedVertex {

[Killed] BlockStatement
src/models/Graph/Graph.ts:247:40
 	 * @param vertexA The source vertex.
 	 * @param vertexB The target vertex.
 	 */
-	getEdges(vertexA: V, vertexB: V): E[] {
-		return this.getListOfEdges().filter(
-			(maybeWantedEdge) =>
-				(maybeWantedEdge.vertexA.equals(vertexA) && maybeWantedEdge.vertexB.equals(vertexB)) ||
-				(maybeWantedEdge.isDirected() &&
-					maybeWantedEdge.vertexA.equals(vertexB) &&
-					maybeWantedEdge.vertexB.equals(vertexA)),
-		);
-	}
+	getEdges(vertexA: V, vertexB: V): E[] {}
 
 	/**
killedBy: g.*dfsIterator() Normal Case Works for directed graph
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ArrowFunction
src/models/Graph/Graph.ts:249:4
 	 */
 	getEdges(vertexA: V, vertexB: V): E[] {
 		return this.getListOfEdges().filter(
-			(maybeWantedEdge) =>
-				(maybeWantedEdge.vertexA.equals(vertexA) && maybeWantedEdge.vertexB.equals(vertexB)) ||
-				(maybeWantedEdge.isDirected() &&
-					maybeWantedEdge.vertexA.equals(vertexB) &&
-					maybeWantedEdge.vertexB.equals(vertexA)),
+			() => undefined,
 		);
 	}
killedBy: g.*dfsIterator() Normal Case Returns last taken edge correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 16
+ Received  +  2

  Array [
    null,
-   DirectedEdge {

[Killed] ConditionalExpression
src/models/Graph/Graph.ts:250:5
 	getEdges(vertexA: V, vertexB: V): E[] {
 		return this.getListOfEdges().filter(
 			(maybeWantedEdge) =>
-				(maybeWantedEdge.vertexA.equals(vertexA) && maybeWantedEdge.vertexB.equals(vertexB)) ||
-				(maybeWantedEdge.isDirected() &&
-					maybeWantedEdge.vertexA.equals(vertexB) &&
-					maybeWantedEdge.vertexB.equals(vertexA)),
+				true,
 		);
 	}
killedBy: g.*dfsIterator() Normal Case Returns last taken edge correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -8,14 +8,14 @@
        "name": "c",
      },

[Killed] ConditionalExpression
src/models/Graph/Graph.ts:250:5
 	getEdges(vertexA: V, vertexB: V): E[] {
 		return this.getListOfEdges().filter(
 			(maybeWantedEdge) =>
-				(maybeWantedEdge.vertexA.equals(vertexA) && maybeWantedEdge.vertexB.equals(vertexB)) ||
-				(maybeWantedEdge.isDirected() &&
-					maybeWantedEdge.vertexA.equals(vertexB) &&
-					maybeWantedEdge.vertexB.equals(vertexA)),
+				false,
 		);
 	}
killedBy: g.*dfsIterator() Normal Case Returns last taken edge correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 16
+ Received  +  2

  Array [
    null,
-   DirectedEdge {

[Killed] LogicalOperator
src/models/Graph/Graph.ts:251:6
 		return this.getListOfEdges().filter(
 			(maybeWantedEdge) =>
 				(maybeWantedEdge.vertexA.equals(vertexA) && maybeWantedEdge.vertexB.equals(vertexB)) ||
-				(maybeWantedEdge.isDirected() &&
-					maybeWantedEdge.vertexA.equals(vertexB) &&
+				(maybeWantedEdge.isDirected() || maybeWantedEdge.vertexA.equals(vertexB) &&
 					maybeWantedEdge.vertexB.equals(vertexA)),
 		);
killedBy: g.*dfsIterator() Normal Case Returns last taken edge correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -8,14 +8,14 @@
        "name": "c",
      },

[Killed] ConditionalExpression
src/models/Graph/Graph.ts:251:6
 		return this.getListOfEdges().filter(
 			(maybeWantedEdge) =>
 				(maybeWantedEdge.vertexA.equals(vertexA) && maybeWantedEdge.vertexB.equals(vertexB)) ||
-				(maybeWantedEdge.isDirected() &&
-					maybeWantedEdge.vertexA.equals(vertexB) &&
+				(true &&
 					maybeWantedEdge.vertexB.equals(vertexA)),
 		);
killedBy: g.*dfsIterator() Normal Case Returns last taken edge correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -8,14 +8,14 @@
        "name": "c",
      },

[Survived] BlockStatement
src/models/Graph/Graph.ts:276:4
 		initialPayload: T,
 		startVertex?: V,
 		orderFunction: (a: V, b: V, more?: GraphIterationCallbackParameter<V, E, this, T>) => number = vertexCompareTo,
-	) {
-		const payload: T = initialPayload;
-		for (const dfsIteration of this.dfsIterator(startVertex, orderFunction)) cb({ ...dfsIteration, payload });
-	}
+	) {}
 
 	*dfsIterator(

[Killed] EqualityOperator
src/models/Graph/Graph.ts:293:7
 		for (const singleVertexInGraph of this.getListOfVertices()) visited.set(singleVertexInGraph, false);
 		let currentVertex: V | undefined;
 
-		if (startVertex === undefined) {
+		if (startVertex !== undefined) {
 			const listOfNodes = this.getListOfVertices();
 			if (listOfNodes.length === 0) currentVertex = undefined;
killedBy: g.*dfsIterator() Normal Case Works for directed graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

- Array [
-   NamedVertex {
-     "name": "a",

[Killed] ConditionalExpression
src/models/Graph/Graph.ts:314:9
 
 			while (![...visited.values()].every((x) => x)) {
 				currentVertex = stack.pop();
-				if (currentVertex === undefined) {
+				if (false) {
 					takenEdge = null;
 					previousVertex = null;
killedBy: g.*dfsIterator() Normal Case Works for directed graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 0

@@ -6,12 +6,6 @@
      "name": "c",
    },

[Killed] EqualityOperator
src/models/Graph/Graph.ts:323:10
 							break;
 						}
 				} else {
-					if (previousVertex !== null) {
+					if (previousVertex === null) {
 						const possibleEdges = this.getEdges(previousVertex, currentVertex);
 						if (possibleEdges.length === 0) takenEdge = null;
killedBy: g.*dfsIterator() Normal Case Returns last taken edge correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 16
+ Received  +  2

  Array [
    null,
-   DirectedEdge {

[Timeout] ConditionalExpression
src/models/Graph/Graph.ts:334:9
 
 				if (currentVertex === undefined) break;
 
-				if (!visited.get(currentVertex)) {
+				if (true) {
 					visited.set(currentVertex, true);
 					const adjacentVertices = this.getChildVertices(currentVertex);

[Killed] ConditionalExpression
src/models/Graph/Graph.ts:366:5
 
 		this.getListOfEdges().forEach((singleEdge) => {
 			if (
-				subgraph.isVertexContainedInGraph(singleEdge.vertexA) &&
-				subgraph.isVertexContainedInGraph(singleEdge.vertexB)
+				false
 			)
 				subgraph.addEdge(singleEdge);
killedBy: g.getSubgraph(vs) Normal Cases Edges which had both vertices passed are contained
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 42
+ Received  +  1

- Array [
-   DirectedEdge {
-     "vertexA": NamedVertex {
