[Killed] ArrayDeclaration
models/Graph/algorithms/TarjanStronglyConnectedComponentsAlgorithm.ts:10:16
 		this.graph = graph;
 
 		this.discreteTime = 0;
-		this.stack = [];
+		this.stack = ["Stryker was here"];
 		this.lowMap = new MutableHashMap();
 		this.discMap = new MutableHashMap();
killedBy: g.getStronglyConnectedComponent() Normal Cases Works with directed edges
statusReason: TypeError: stackVertex.equals is not a function

[Killed] BooleanLiteral
models/Graph/algorithms/TarjanStronglyConnectedComponentsAlgorithm.ts:30:8
 		const algo = new TarjanStronglyConnectedComponentsAlgorithm(graph);
 
 		algo.graph.getListOfVertices().forEach((singleVertex) => {
-			if (!algo.discMap.has(singleVertex)) algo.dfsUtil(singleVertex);
+			if (algo.discMap.has(singleVertex)) algo.dfsUtil(singleVertex);
 		});
 
killedBy: g.getStronglyConnectedComponent() Normal Cases Works with directed edges
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

- Array [
-   Array [
-     NamedVertex {

[Killed] BlockStatement
models/Graph/algorithms/TarjanStronglyConnectedComponentsAlgorithm.ts:41:71
 		this.lowMap.set(currentVertex, this.discreteTime);
 		this.discreteTime += 1;
 		this.stack.push(currentVertex);
-		this.graph.getChildVertices(currentVertex).forEach((childVertex) => {
-			if (!this.discMap.has(childVertex)) {
-				this.dfsUtil(childVertex);
-				this.lowMap.set(
-					currentVertex,
-					Math.min(this.lowMap.get(currentVertex) ?? -1, this.lowMap.get(childVertex) ?? -1),
-				);
-			} else if (this.stack.find((stackVertex) => stackVertex.equals(childVertex)) !== undefined) {
-				this.lowMap.set(
-					currentVertex,
-					Math.min(this.lowMap.get(currentVertex) ?? -1, this.discMap.get(childVertex) ?? -1),
-				);
-			}
-		});
+		this.graph.getChildVertices(currentVertex).forEach((childVertex) => {});
 
 		if (this.lowMap.get(currentVertex) === this.discMap.get(currentVertex)) {
killedBy: g.getStronglyConnectedComponent() Normal Cases Works with directed edges
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 6

@@ -1,15 +1,19 @@
  Array [
    Array [

[Killed] BlockStatement
models/Graph/algorithms/TarjanStronglyConnectedComponentsAlgorithm.ts:42:40
 		this.discreteTime += 1;
 		this.stack.push(currentVertex);
 		this.graph.getChildVertices(currentVertex).forEach((childVertex) => {
-			if (!this.discMap.has(childVertex)) {
-				this.dfsUtil(childVertex);
-				this.lowMap.set(
-					currentVertex,
-					Math.min(this.lowMap.get(currentVertex) ?? -1, this.lowMap.get(childVertex) ?? -1),
-				);
-			} else if (this.stack.find((stackVertex) => stackVertex.equals(childVertex)) !== undefined) {
+			if (!this.discMap.has(childVertex)) {} else if (this.stack.find((stackVertex) => stackVertex.equals(childVertex)) !== undefined) {
 				this.lowMap.set(
 					currentVertex,
killedBy: g.getStronglyConnectedComponent() Normal Cases Works with directed edges
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 6

@@ -1,15 +1,19 @@
  Array [
    Array [

[Killed] LogicalOperator
models/Graph/algorithms/TarjanStronglyConnectedComponentsAlgorithm.ts:46:53
 				this.dfsUtil(childVertex);
 				this.lowMap.set(
 					currentVertex,
-					Math.min(this.lowMap.get(currentVertex) ?? -1, this.lowMap.get(childVertex) ?? -1),
+					Math.min(this.lowMap.get(currentVertex) ?? -1, this.lowMap.get(childVertex) && -1),
 				);
 			} else if (this.stack.find((stackVertex) => stackVertex.equals(childVertex)) !== undefined) {
killedBy: g.getStronglyConnectedComponent() Normal Cases Works with undirected edges
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 24
+ Received  +  1

- Array [
-   Array [
-     NamedVertex {

[Killed] LogicalOperator
models/Graph/algorithms/TarjanStronglyConnectedComponentsAlgorithm.ts:46:15
 				this.dfsUtil(childVertex);
 				this.lowMap.set(
 					currentVertex,
-					Math.min(this.lowMap.get(currentVertex) ?? -1, this.lowMap.get(childVertex) ?? -1),
+					Math.min(this.lowMap.get(currentVertex) && -1, this.lowMap.get(childVertex) ?? -1),
 				);
 			} else if (this.stack.find((stackVertex) => stackVertex.equals(childVertex)) !== undefined) {
killedBy: g.getStronglyConnectedComponent() Normal Cases Works with directed edges
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

- Array [
-   Array [
-     NamedVertex {

[Killed] ArrowFunction
models/Graph/algorithms/TarjanStronglyConnectedComponentsAlgorithm.ts:48:31
 					currentVertex,
 					Math.min(this.lowMap.get(currentVertex) ?? -1, this.lowMap.get(childVertex) ?? -1),
 				);
-			} else if (this.stack.find((stackVertex) => stackVertex.equals(childVertex)) !== undefined) {
+			} else if (this.stack.find(() => undefined) !== undefined) {
 				this.lowMap.set(
 					currentVertex,
killedBy: g.getStronglyConnectedComponent() Normal Cases Works with directed edges
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 4

@@ -1,13 +1,17 @@
  Array [
    Array [

[Killed] ConditionalExpression
models/Graph/algorithms/TarjanStronglyConnectedComponentsAlgorithm.ts:48:15
 					currentVertex,
 					Math.min(this.lowMap.get(currentVertex) ?? -1, this.lowMap.get(childVertex) ?? -1),
 				);
-			} else if (this.stack.find((stackVertex) => stackVertex.equals(childVertex)) !== undefined) {
+			} else if (true) {
 				this.lowMap.set(
 					currentVertex,
killedBy: g.getStronglyConnectedComponent() Normal Cases Works with directed edges
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  0

@@ -8,16 +8,6 @@
      },
      NamedVertex {

[Killed] LogicalOperator
models/Graph/algorithms/TarjanStronglyConnectedComponentsAlgorithm.ts:51:53
 			} else if (this.stack.find((stackVertex) => stackVertex.equals(childVertex)) !== undefined) {
 				this.lowMap.set(
 					currentVertex,
-					Math.min(this.lowMap.get(currentVertex) ?? -1, this.discMap.get(childVertex) ?? -1),
+					Math.min(this.lowMap.get(currentVertex) ?? -1, this.discMap.get(childVertex) && -1),
 				);
 			}
killedBy: g.getStronglyConnectedComponent() Normal Cases Works with undirected edges
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 24
+ Received  +  1

- Array [
-   Array [
-     NamedVertex {

[Killed] LogicalOperator
models/Graph/algorithms/TarjanStronglyConnectedComponentsAlgorithm.ts:51:15
 			} else if (this.stack.find((stackVertex) => stackVertex.equals(childVertex)) !== undefined) {
 				this.lowMap.set(
 					currentVertex,
-					Math.min(this.lowMap.get(currentVertex) ?? -1, this.discMap.get(childVertex) ?? -1),
+					Math.min(this.lowMap.get(currentVertex) && -1, this.discMap.get(childVertex) ?? -1),
 				);
 			}
killedBy: g.getStronglyConnectedComponent() Normal Cases Works with directed edges
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

- Array [
-   Array [
-     NamedVertex {

[Killed] ConditionalExpression
models/Graph/algorithms/TarjanStronglyConnectedComponentsAlgorithm.ts:56:7
 			}
 		});
 
-		if (this.lowMap.get(currentVertex) === this.discMap.get(currentVertex)) {
+		if (true) {
 			const currentComponent: V[] = [];
 			let otherVertex: V;
killedBy: g.getStronglyConnectedComponent() Normal Cases Works with directed edges
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 4

@@ -1,13 +1,17 @@
  Array [
    Array [

[Killed] EqualityOperator
models/Graph/algorithms/TarjanStronglyConnectedComponentsAlgorithm.ts:56:7
 			}
 		});
 
-		if (this.lowMap.get(currentVertex) === this.discMap.get(currentVertex)) {
+		if (this.lowMap.get(currentVertex) !== this.discMap.get(currentVertex)) {
 			const currentComponent: V[] = [];
 			let otherVertex: V;
killedBy: g.getStronglyConnectedComponent() Normal Cases Works with directed edges
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 2

  Array [
    Array [
      NamedVertex {
