[Killed] BlockStatement
src/models/AdjacencyList/AdjacencyList.ts:12:30
 		this._adjacencyList = new MutableHashMap<V, V[]>();
 	}
 
-	initVertex(vertex: V): void {
-		this._adjacencyList.set(vertex, []);
-	}
+	initVertex(vertex: V): void {}
 
 	protected _areAdjacent(from: V, to: V): boolean {
killedBy: graph.deleteVertex(v) directed edges graph is initially as expected
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   NamedVertex {
-     "name": "b",

[Survived] BlockStatement
src/models/AdjacencyList/AdjacencyList.ts:16:50
 		this._adjacencyList.set(vertex, []);
 	}
 
-	protected _areAdjacent(from: V, to: V): boolean {
-		return this.getAdjacentVertices(from).find((singleVertex) => singleVertex.equals(to)) !== undefined;
-	}
+	protected _areAdjacent(from: V, to: V): boolean {}
 
 	getAdjacentVertices(vertex: V): V[] {

[Killed] ConditionalExpression
src/models/AdjacencyList/AdjacencyList.ts:17:10
 	}
 
 	protected _areAdjacent(from: V, to: V): boolean {
-		return this.getAdjacentVertices(from).find((singleVertex) => singleVertex.equals(to)) !== undefined;
+		return true;
 	}
 
killedBy: g.addEdge() Normal Cases Adding a directed Edge update the adjacency list accordingly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Array [
-   NamedVertex {
-     "name": "b",

[Killed] EqualityOperator
src/models/AdjacencyList/AdjacencyList.ts:17:10
 	}
 
 	protected _areAdjacent(from: V, to: V): boolean {
-		return this.getAdjacentVertices(from).find((singleVertex) => singleVertex.equals(to)) !== undefined;
+		return this.getAdjacentVertices(from).find(singleVertex => singleVertex.equals(to)) === undefined;
 	}
 
killedBy: graph.deleteVertex(v) directed edges graph is initially as expected
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   NamedVertex {
-     "name": "b",

[Killed] BlockStatement
src/models/AdjacencyList/AdjacencyList.ts:24:45
 		return this._adjacencyList.get(vertex) ?? [];
 	}
 
-	addAdjacency(vertexA: V, vertexB: V): void {
-		if (this._areAdjacent(vertexA, vertexB)) return;
-		this.getAdjacentVertices(vertexA).push(vertexB);
-		this.getAdjacentVertices(vertexB).push(vertexA);
-	}
+	addAdjacency(vertexA: V, vertexB: V): void {}
 
 	deleteVertex(vertex: V): void {
killedBy: graph.deleteVertex(v) directed edges graph is initially as expected
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   NamedVertex {
-     "name": "b",

[Killed] ConditionalExpression
src/models/AdjacencyList/AdjacencyList.ts:25:7
 	}
 
 	addAdjacency(vertexA: V, vertexB: V): void {
-		if (this._areAdjacent(vertexA, vertexB)) return;
+		if (true) return;
 		this.getAdjacentVertices(vertexA).push(vertexB);
 		this.getAdjacentVertices(vertexB).push(vertexA);
killedBy: graph.deleteVertex(v) directed edges graph is initially as expected
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   NamedVertex {
-     "name": "b",

[Survived] ConditionalExpression
src/models/AdjacencyList/AdjacencyList.ts:25:7
 	}
 
 	addAdjacency(vertexA: V, vertexB: V): void {
-		if (this._areAdjacent(vertexA, vertexB)) return;
+		if (false) return;
 		this.getAdjacentVertices(vertexA).push(vertexB);
 		this.getAdjacentVertices(vertexB).push(vertexA);

[Killed] BlockStatement
src/models/AdjacencyList/AdjacencyList.ts:30:32
 		this.getAdjacentVertices(vertexB).push(vertexA);
 	}
 
-	deleteVertex(vertex: V): void {
-		this._adjacencyList.delete(vertex);
-		for (const [key, value] of this._adjacencyList.entries()) {
-			this._adjacencyList.set(
-				key,
-				value.filter((x) => !x.equals(vertex)),
-			);
-		}
-	}
+	deleteVertex(vertex: V): void {}
 
 	deleteEdge(edge: Edge<V>): void {
killedBy: graph.deleteVertex(v) adjacencyList is correct removes the vertex a and finds an empty list (default) for that vertex
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 2

[Survived] BlockStatement
src/models/AdjacencyList/AdjacencyList.ts:32:61
 
 	deleteVertex(vertex: V): void {
 		this._adjacencyList.delete(vertex);
-		for (const [key, value] of this._adjacencyList.entries()) {
-			this._adjacencyList.set(
-				key,
-				value.filter((x) => !x.equals(vertex)),
-			);
-		}
+		for (const [key, value] of this._adjacencyList.entries()) {}
 	}
 

[Survived] ArrowFunction
src/models/AdjacencyList/AdjacencyList.ts:35:18
 		for (const [key, value] of this._adjacencyList.entries()) {
 			this._adjacencyList.set(
 				key,
-				value.filter((x) => !x.equals(vertex)),
+				value.filter(() => undefined),
 			);
 		}

[Survived] BooleanLiteral
src/models/AdjacencyList/AdjacencyList.ts:35:25
 		for (const [key, value] of this._adjacencyList.entries()) {
 			this._adjacencyList.set(
 				key,
-				value.filter((x) => !x.equals(vertex)),
+				value.filter((x) => x.equals(vertex)),
 			);
 		}

[Killed] BlockStatement
src/models/AdjacencyList/AdjacencyList.ts:40:34
 		}
 	}
 
-	deleteEdge(edge: Edge<V>): void {
-		const previousDirectedEdgeVertices = this._adjacencyList.get(edge.vertexA);
-		if (previousDirectedEdgeVertices) {
-			this._adjacencyList.set(
-				edge.vertexA,
-				previousDirectedEdgeVertices.filter((x) => !x.equals(edge.vertexB)),
-			);
-		}
-
-		// Because it is about adjacency it must be done for both directed and undirected edges
-		const previousOppositeEdge = this._adjacencyList.get(edge.vertexB);
-		if (previousOppositeEdge) {
-			this._adjacencyList.set(
-				edge.vertexB,
-				previousOppositeEdge.filter((x) => !x.equals(edge.vertexA)),
-			);
-		}
-	}
+	deleteEdge(edge: Edge<V>): void {}
 }
 
killedBy: graph.deleteVertex(v) directed edges adjacencyList is correct removes the edge a -> b and removes the entry of b in the list of a
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] BlockStatement
src/models/AdjacencyList/AdjacencyList.ts:42:37
 
 	deleteEdge(edge: Edge<V>): void {
 		const previousDirectedEdgeVertices = this._adjacencyList.get(edge.vertexA);
-		if (previousDirectedEdgeVertices) {
-			this._adjacencyList.set(
-				edge.vertexA,
-				previousDirectedEdgeVertices.filter((x) => !x.equals(edge.vertexB)),
-			);
-		}
+		if (previousDirectedEdgeVertices) {}
 
 		// Because it is about adjacency it must be done for both directed and undirected edges
killedBy: graph.deleteVertex(v) directed edges adjacencyList is correct removes the edge a -> b and removes the entry of b in the list of a
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
src/models/AdjacencyList/AdjacencyList.ts:42:7
 
 	deleteEdge(edge: Edge<V>): void {
 		const previousDirectedEdgeVertices = this._adjacencyList.get(edge.vertexA);
-		if (previousDirectedEdgeVertices) {
+		if (false) {
 			this._adjacencyList.set(
 				edge.vertexA,
killedBy: graph.deleteVertex(v) directed edges adjacencyList is correct removes the edge a -> b and removes the entry of b in the list of a
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ArrowFunction
src/models/AdjacencyList/AdjacencyList.ts:45:41
 		if (previousDirectedEdgeVertices) {
 			this._adjacencyList.set(
 				edge.vertexA,
-				previousDirectedEdgeVertices.filter((x) => !x.equals(edge.vertexB)),
+				previousDirectedEdgeVertices.filter(() => undefined),
 			);
 		}
killedBy: graph.deleteVertex(v) directed edges adjacencyList is correct removes the edge a -> b and contains other vertices still in the list of a
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BooleanLiteral
src/models/AdjacencyList/AdjacencyList.ts:45:48
 		if (previousDirectedEdgeVertices) {
 			this._adjacencyList.set(
 				edge.vertexA,
-				previousDirectedEdgeVertices.filter((x) => !x.equals(edge.vertexB)),
+				previousDirectedEdgeVertices.filter((x) => x.equals(edge.vertexB)),
 			);
 		}
killedBy: graph.deleteVertex(v) directed edges adjacencyList is correct removes the edge a -> b and removes the entry of b in the list of a
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
src/models/AdjacencyList/AdjacencyList.ts:51:7
 
 		// Because it is about adjacency it must be done for both directed and undirected edges
 		const previousOppositeEdge = this._adjacencyList.get(edge.vertexB);
-		if (previousOppositeEdge) {
+		if (false) {
 			this._adjacencyList.set(
 				edge.vertexB,
killedBy: graph.deleteVertex(v) directed edges adjacencyList is correct removes the edge a -> b and removes the entry of a in the list of b
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] BlockStatement
src/models/AdjacencyList/AdjacencyList.ts:51:29
 
 		// Because it is about adjacency it must be done for both directed and undirected edges
 		const previousOppositeEdge = this._adjacencyList.get(edge.vertexB);
-		if (previousOppositeEdge) {
-			this._adjacencyList.set(
-				edge.vertexB,
-				previousOppositeEdge.filter((x) => !x.equals(edge.vertexA)),
-			);
-		}
+		if (previousOppositeEdge) {}
 	}
 }
killedBy: graph.deleteVertex(v) directed edges adjacencyList is correct removes the edge a -> b and removes the entry of a in the list of b
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] BooleanLiteral
src/models/AdjacencyList/AdjacencyList.ts:54:40
 		if (previousOppositeEdge) {
 			this._adjacencyList.set(
 				edge.vertexB,
-				previousOppositeEdge.filter((x) => !x.equals(edge.vertexA)),
+				previousOppositeEdge.filter((x) => x.equals(edge.vertexA)),
 			);
 		}
killedBy: graph.deleteVertex(v) directed edges adjacencyList is correct removes the edge a -> b and removes the entry of a in the list of b
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ArrowFunction
src/models/AdjacencyList/AdjacencyList.ts:54:33
 		if (previousOppositeEdge) {
 			this._adjacencyList.set(
 				edge.vertexB,
-				previousOppositeEdge.filter((x) => !x.equals(edge.vertexA)),
+				previousOppositeEdge.filter(() => undefined),
 			);
 		}
killedBy: graph.deleteVertex(v) directed edges adjacencyList is correct removes the edge a -> b and contains other vertices still in the list of b
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0
