[Killed] BlockStatement
models/Edge/Edge/Edge.ts:8:38
 	vertexA: V;
 	vertexB: V;
 
-	constructor(vertexA: V, vertexB: V) {
-		this.vertexA = vertexA;
-		this.vertexB = vertexB;
-	}
+	constructor(vertexA: V, vertexB: V) {}
 
 	transpose(): void {
killedBy: graph.deleteVertex(v) graph is initially as expected
statusReason: TypeError: Cannot read properties of undefined (reading 'hashCode')
