[Killed] BlockStatement
src/models/Matrix/AdjacencyMatrix.ts:15:28
 
 		edgeList.forEach((edge) => {
 			matrix.set(edge.vertexA, edge.vertexB, true);
-			if (!edge.isDirected()) {
-				matrix.set(edge.vertexB, edge.vertexA, true);
-			}
+			if (!edge.isDirected()) {}
 		});
 
killedBy: g.transpose() Normal Cases Adjacency matrix is correct after transposing
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false
