[Killed] ConditionalExpression
src/models/Matrix/Matrix.ts:12:7
 	}
 
 	set(row: RowType, column: ColumnType, value: ValueType): void {
-		if (!this.matrix.has(row)) this.matrix.set(row, new MutableHashMap());
+		if (false) this.matrix.set(row, new MutableHashMap());
 
 		this.matrix.get(row)!.set(column, value);
killedBy: graph.deleteVertex(v) directed edges graph is initially as expected
statusReason: TypeError: Cannot read properties of undefined (reading 'set')

[Killed] ConditionalExpression
src/models/Matrix/Matrix.ts:19:7
 
 	get(row: RowType, column: ColumnType): ValueType {
 		const rowData = this.matrix.get(row);
-		if (rowData === undefined) return this.defaultValue;
+		if (false) return this.defaultValue;
 
 		const cellData = rowData.get(column);
killedBy: g.addEdge() Normal Cases Adding an directed edge updates the adjacency matrix asymmetrically
statusReason: TypeError: Cannot read properties of undefined (reading 'get')

[Killed] EqualityOperator
src/models/Matrix/Matrix.ts:22:7
 		if (rowData === undefined) return this.defaultValue;
 
 		const cellData = rowData.get(column);
-		if (cellData === undefined) return this.defaultValue;
+		if (cellData !== undefined) return this.defaultValue;
 
 		return cellData;
killedBy: graph.deleteVertex(v) directed edges graph is initially as expected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined
