[Killed] BlockStatement
src/Parser/SimpleGDFParser/SimpleGDFParser.ts:12:73
     lines: string[] = [];
     currentGraph: Graph<any, any> = new Graph<NamedVertex, DirectedEdge<NamedVertex>>();
 
-    parse(input: string): Graph<NamedVertex, DirectedEdge<NamedVertex>> {
-        this.read(input);
-        while (this.lines.length > 0) {
-            this.parseNextStep();
-        }
-
-        return this.currentGraph.copy();
-    }
+    parse(input: string): Graph<NamedVertex, DirectedEdge<NamedVertex>> {}
 
     parseNextStep(): Graph<any, any> | null {
killedBy: g.getSubgraph(vs) Normal Cases All passed vertices are contained
statusReason: TypeError: Cannot read properties of undefined (reading 'getSubgraph')

[Killed] ConditionalExpression
src/Parser/SimpleGDFParser/SimpleGDFParser.ts:14:16
 
     parse(input: string): Graph<NamedVertex, DirectedEdge<NamedVertex>> {
         this.read(input);
-        while (this.lines.length > 0) {
+        while (false) {
             this.parseNextStep();
         }
killedBy: SimpleGDFParser List of vertices are as expected
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 32
+ Received  +  1

- Array [
-   NamedVertex {
-     "name": "a",

[Killed] EqualityOperator
src/Parser/SimpleGDFParser/SimpleGDFParser.ts:14:16
 
     parse(input: string): Graph<NamedVertex, DirectedEdge<NamedVertex>> {
         this.read(input);
-        while (this.lines.length > 0) {
+        while (this.lines.length <= 0) {
             this.parseNextStep();
         }
killedBy: SimpleGDFParser List of vertices are as expected
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 32
+ Received  +  1

- Array [
-   NamedVertex {
-     "name": "a",

[Killed] EqualityOperator
src/Parser/SimpleGDFParser/SimpleGDFParser.ts:23:13
 
     parseNextStep(): Graph<any, any> | null {
         const nextLine = this.lines.shift();
-        if (nextLine === undefined) {
+        if (nextLine !== undefined) {
             return null;
         }
killedBy: g.getSubgraph(vs) Normal Cases All passed vertices are contained
statusReason: Error: Vertex {"name":"a"} not found in graph.

[Killed] ConditionalExpression
src/Parser/SimpleGDFParser/SimpleGDFParser.ts:23:13
 
     parseNextStep(): Graph<any, any> | null {
         const nextLine = this.lines.shift();
-        if (nextLine === undefined) {
+        if (true) {
             return null;
         }
killedBy: SimpleGDFParser List of vertices are as expected
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 32
+ Received  +  1

- Array [
-   NamedVertex {
-     "name": "a",

[Killed] ConditionalExpression
src/Parser/SimpleGDFParser/SimpleGDFParser.ts:27:13
             return null;
         }
 
-        if (nextLine.startsWith('nodedef')) {
+        if (true) {
             this.currentMode = 'nodedef';
             return this.parseNextStep();
killedBy: g.getSubgraph(vs) Normal Cases All passed vertices are contained
statusReason: Error: Vertex {"name":"a"} not found in graph.

[Killed] BlockStatement
src/Parser/SimpleGDFParser/SimpleGDFParser.ts:27:45
             return null;
         }
 
-        if (nextLine.startsWith('nodedef')) {
-            this.currentMode = 'nodedef';
-            return this.parseNextStep();
-        }
+        if (nextLine.startsWith('nodedef')) {}
 
         if (nextLine.startsWith('edgedef')) {
killedBy: g.getSubgraph(vs) Normal Cases All passed vertices are contained
statusReason: Error: Vertex {"name":"a"} not found in graph.

[Killed] StringLiteral
src/Parser/SimpleGDFParser/SimpleGDFParser.ts:28:32
         }
 
         if (nextLine.startsWith('nodedef')) {
-            this.currentMode = 'nodedef';
+            this.currentMode = "";
             return this.parseNextStep();
         }
killedBy: g.getSubgraph(vs) Normal Cases All passed vertices are contained
statusReason: Error: Vertex {"name":"a"} not found in graph.

[Killed] ConditionalExpression
src/Parser/SimpleGDFParser/SimpleGDFParser.ts:32:13
             return this.parseNextStep();
         }
 
-        if (nextLine.startsWith('edgedef')) {
+        if (true) {
             this.currentMode = 'edgedef';
             return this.parseNextStep();
killedBy: g.getSubgraph(vs) Normal Cases All passed vertices are contained
statusReason: Error: Vertex {"name":"a"} not found in graph.

[Killed] BlockStatement
src/Parser/SimpleGDFParser/SimpleGDFParser.ts:32:45
             return this.parseNextStep();
         }
 
-        if (nextLine.startsWith('edgedef')) {
-            this.currentMode = 'edgedef';
-            return this.parseNextStep();
-        }
+        if (nextLine.startsWith('edgedef')) {}
 
         if (this.currentMode === 'nodedef') {
killedBy: g.getSubgraph(vs) Normal Cases Edges which had both vertices passed are contained
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 47
+ Received  +  1

- Array [
-   DirectedEdge {
-     "_type": "DirectedEdge",

[Killed] StringLiteral
src/Parser/SimpleGDFParser/SimpleGDFParser.ts:33:32
         }
 
         if (nextLine.startsWith('edgedef')) {
-            this.currentMode = 'edgedef';
+            this.currentMode = "";
             return this.parseNextStep();
         }
killedBy: g.getSubgraph(vs) Normal Cases Edges which had both vertices passed are contained
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 47
+ Received  +  1

- Array [
-   DirectedEdge {
-     "_type": "DirectedEdge",

[Killed] ConditionalExpression
src/Parser/SimpleGDFParser/SimpleGDFParser.ts:37:13
             return this.parseNextStep();
         }
 
-        if (this.currentMode === 'nodedef') {
+        if (false) {
             const vertexName = nextLine.trim();
             this.currentGraph.addVertex(new NamedVertex(vertexName));
killedBy: g.getSubgraph(vs) Normal Cases All passed vertices are contained
statusReason: Error: Vertex {"name":"a"} not found in graph.

[Killed] ConditionalExpression
src/Parser/SimpleGDFParser/SimpleGDFParser.ts:37:13
             return this.parseNextStep();
         }
 
-        if (this.currentMode === 'nodedef') {
+        if (true) {
             const vertexName = nextLine.trim();
             this.currentGraph.addVertex(new NamedVertex(vertexName));
killedBy: SimpleGDFParser List of vertices are as expected
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 45

  Array [
    NamedVertex {
      "name": "a",

[Killed] EqualityOperator
src/Parser/SimpleGDFParser/SimpleGDFParser.ts:42:13
             this.currentGraph.addVertex(new NamedVertex(vertexName));
         }
 
-        if (this.currentMode === 'edgedef') {
+        if (this.currentMode !== 'edgedef') {
             const [vertexNameA, vertexNameB] = nextLine.split(',');
             this.currentGraph.addEdge(new DirectedEdge(new NamedVertex(vertexNameA), new NamedVertex(vertexNameB)));
killedBy: SimpleGDFParser Loads peterson graph
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/Parser/SimpleGDFParser/SimpleGDFParser.ts:42:45
             this.currentGraph.addVertex(new NamedVertex(vertexName));
         }
 
-        if (this.currentMode === 'edgedef') {
-            const [vertexNameA, vertexNameB] = nextLine.split(',');
-            this.currentGraph.addEdge(new DirectedEdge(new NamedVertex(vertexNameA), new NamedVertex(vertexNameB)));
-        }
+        if (this.currentMode === 'edgedef') {}
 
         return this.currentGraph.copy();
killedBy: SimpleGDFParser List of edges are as expected
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 137
+ Received  +   1

- Array [
-   DirectedEdge {
-     "_type": "DirectedEdge",

[Killed] BlockStatement
src/Parser/SimpleGDFParser/SimpleGDFParser.ts:50:34
         return this.currentGraph.copy();
     }
 
-    read(input: string): boolean {
-        this.lines = input.split('\n');
-
-        return true;
-    }
+    read(input: string): boolean {}
 }
 
killedBy: SimpleGDFParser List of vertices are as expected
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 32
+ Received  +  1

- Array [
-   NamedVertex {
-     "name": "a",
