[Killed] BlockStatement
src/models/AdjacencyList/AdjacencyList.ts:8:19
 export class AdjacencyList<V extends Vertex> {
     protected _adjacencyList: MutableHashMap<V, V[]>;
 
-    constructor() {
-        this._adjacencyList = new MutableHashMap<V, V[]>();
-    }
+    constructor() {}
 
     areAdjacent(from: V, to: V): boolean {
killedBy: graph.deleteEdge(e) directed edges graph is initially as expected
statusReason: TypeError: Cannot read properties of undefined (reading 'get')

[Killed] BlockStatement
src/models/AdjacencyList/AdjacencyList.ts:12:42
         this._adjacencyList = new MutableHashMap<V, V[]>();
     }
 
-    areAdjacent(from: V, to: V): boolean {
-        return this.getAdjacentVertices(from).find((singleVertex) => singleVertex.equals(to)) !== undefined;
-    }
+    areAdjacent(from: V, to: V): boolean {}
 
     getAdjacentVertices(vertex: V): V[] {
killedBy: graph.deleteEdge(e) Reproduce #24 2x WeightedUndirectedEdges (not equal) delete 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 3

  Array [
    NamedVertex {
      "name": "b",

[Killed] EqualityOperator
src/models/AdjacencyList/AdjacencyList.ts:13:16
     }
 
     areAdjacent(from: V, to: V): boolean {
-        return this.getAdjacentVertices(from).find((singleVertex) => singleVertex.equals(to)) !== undefined;
+        return this.getAdjacentVertices(from).find(singleVertex => singleVertex.equals(to)) === undefined;
     }
 
killedBy: AdjacencyList a vertex is not adjacent to itself initially: NamedVertex NamedVertex { name: 'a' }
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/models/AdjacencyList/AdjacencyList.ts:13:16
     }
 
     areAdjacent(from: V, to: V): boolean {
-        return this.getAdjacentVertices(from).find((singleVertex) => singleVertex.equals(to)) !== undefined;
+        return false;
     }
 
killedBy: graph.deleteEdge(e) Reproduce #24 2x WeightedUndirectedEdges (not equal) delete 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 3

  Array [
    NamedVertex {
      "name": "b",

[Killed] BlockStatement
src/models/AdjacencyList/AdjacencyList.ts:16:41
         return this.getAdjacentVertices(from).find((singleVertex) => singleVertex.equals(to)) !== undefined;
     }
 
-    getAdjacentVertices(vertex: V): V[] {
-        return this._adjacencyList.get(vertex) ?? [];
-    }
+    getAdjacentVertices(vertex: V): V[] {}
 
     addAdjacency(vertexA: V, vertexB: V): void {
killedBy: g.addEdge() Normal Cases Adding an edge adds it to the edge list as well
statusReason: TypeError: Cannot read properties of undefined (reading 'find')

[Killed] LogicalOperator
src/models/AdjacencyList/AdjacencyList.ts:17:16
     }
 
     getAdjacentVertices(vertex: V): V[] {
-        return this._adjacencyList.get(vertex) ?? [];
+        return this._adjacencyList.get(vertex) && [];
     }
 
killedBy: g.addVertex() Normal Cases Adding a vertex add it to the adjacency list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] BlockStatement
src/models/AdjacencyList/AdjacencyList.ts:20:48
         return this._adjacencyList.get(vertex) ?? [];
     }
 
-    addAdjacency(vertexA: V, vertexB: V): void {
-        if (this.areAdjacent(vertexA, vertexB)) return;
-        this._adjacencyList.set(vertexA, [...this.getAdjacentVertices(vertexA), vertexB]);
-        this._adjacencyList.set(vertexB, [...this.getAdjacentVertices(vertexB), vertexA]);
-    }
+    addAdjacency(vertexA: V, vertexB: V): void {}
 
     deleteVertex(vertex: V): void {
killedBy: graph.deleteEdge(e) directed edges graph is initially as expected
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   NamedVertex {
-     "name": "b",

[Killed] ConditionalExpression
src/models/AdjacencyList/AdjacencyList.ts:21:13
     }
 
     addAdjacency(vertexA: V, vertexB: V): void {
-        if (this.areAdjacent(vertexA, vertexB)) return;
+        if (false) return;
         this._adjacencyList.set(vertexA, [...this.getAdjacentVertices(vertexA), vertexB]);
         this._adjacencyList.set(vertexB, [...this.getAdjacentVertices(vertexB), vertexA]);
killedBy: graph.deleteEdge(e) Reproduce #24 2x WeightedUndirectedEdges (not equal) delete 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 3

  Array [
    NamedVertex {
      "name": "b",

[Killed] ConditionalExpression
src/models/AdjacencyList/AdjacencyList.ts:21:13
     }
 
     addAdjacency(vertexA: V, vertexB: V): void {
-        if (this.areAdjacent(vertexA, vertexB)) return;
+        if (true) return;
         this._adjacencyList.set(vertexA, [...this.getAdjacentVertices(vertexA), vertexB]);
         this._adjacencyList.set(vertexB, [...this.getAdjacentVertices(vertexB), vertexA]);
killedBy: graph.deleteEdge(e) directed edges graph is initially as expected
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   NamedVertex {
-     "name": "b",

[Killed] ArrayDeclaration
src/models/AdjacencyList/AdjacencyList.ts:23:42
     addAdjacency(vertexA: V, vertexB: V): void {
         if (this.areAdjacent(vertexA, vertexB)) return;
         this._adjacencyList.set(vertexA, [...this.getAdjacentVertices(vertexA), vertexB]);
-        this._adjacencyList.set(vertexB, [...this.getAdjacentVertices(vertexB), vertexA]);
+        this._adjacencyList.set(vertexB, []);
     }
 
killedBy: graph.deleteEdge(e) directed edges graph is initially as expected
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Array [
    NamedVertex {
-     "name": "a",

[Killed] BlockStatement
src/models/AdjacencyList/AdjacencyList.ts:26:35
         this._adjacencyList.set(vertexB, [...this.getAdjacentVertices(vertexB), vertexA]);
     }
 
-    deleteVertex(vertex: V): void {
-        this._adjacencyList.delete(vertex);
-        for (const [key, value] of this._adjacencyList.entries()) {
-            this._adjacencyList.set(
-                key,
-                value.filter((x) => !x.equals(vertex))
-            );
-        }
-    }
+    deleteVertex(vertex: V): void {}
 
     deleteEdge(edge: Edge<V>): void {
killedBy: AdjacencyList adding adjacency and then a vertex it will make the same vertices in the same order not adjacent
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/models/AdjacencyList/AdjacencyList.ts:28:67
 
     deleteVertex(vertex: V): void {
         this._adjacencyList.delete(vertex);
-        for (const [key, value] of this._adjacencyList.entries()) {
-            this._adjacencyList.set(
-                key,
-                value.filter((x) => !x.equals(vertex))
-            );
-        }
+        for (const [key, value] of this._adjacencyList.entries()) {}
     }
 
killedBy: AdjacencyList adding adjacency and then deleting a vertex it will make the same vertices in the reverse order not adjacent
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrowFunction
src/models/AdjacencyList/AdjacencyList.ts:31:30
         for (const [key, value] of this._adjacencyList.entries()) {
             this._adjacencyList.set(
                 key,
-                value.filter((x) => !x.equals(vertex))
+                value.filter(() => undefined)
             );
         }
killedBy: AdjacencyList deleting a not listed vertex does not affect other adjacency
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/models/AdjacencyList/AdjacencyList.ts:31:37
         for (const [key, value] of this._adjacencyList.entries()) {
             this._adjacencyList.set(
                 key,
-                value.filter((x) => !x.equals(vertex))
+                value.filter((x) => x.equals(vertex))
             );
         }
killedBy: AdjacencyList adding adjacency and then deleting a vertex it will make the same vertices in the reverse order not adjacent
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/models/AdjacencyList/AdjacencyList.ts:36:37
         }
     }
 
-    deleteEdge(edge: Edge<V>): void {
-        const vertexAList = this._adjacencyList.get(edge.vertexA) ?? [];
-        const newVertexAList = vertexAList.filter((x) => !x.equals(edge.vertexB));
-        if (newVertexAList.length > 0) {
-            this._adjacencyList.set(edge.vertexA, newVertexAList);
-        } else {
-            this._adjacencyList.delete(edge.vertexA);
-        }
-
-        // Because it is about adjacency it must be done for both directed and undirected edges
-        const vertexBList = this._adjacencyList.get(edge.vertexB) ?? [];
-        const newVertexBList = vertexBList.filter((x) => !x.equals(edge.vertexA));
-        if (newVertexBList.length > 0) {
-            this._adjacencyList.set(edge.vertexB, newVertexBList);
-        } else {
-            this._adjacencyList.delete(edge.vertexB);
-        }
-    }
+    deleteEdge(edge: Edge<V>): void {}
 }
 
killedBy: graph.deleteEdge(e) directed edges adjacencyList is correct removes the edge a -> b and removes the entry of b in the list of a
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] LogicalOperator
src/models/AdjacencyList/AdjacencyList.ts:37:29
     }
 
     deleteEdge(edge: Edge<V>): void {
-        const vertexAList = this._adjacencyList.get(edge.vertexA) ?? [];
+        const vertexAList = this._adjacencyList.get(edge.vertexA) && [];
         const newVertexAList = vertexAList.filter((x) => !x.equals(edge.vertexB));
         if (newVertexAList.length > 0) {
killedBy: graph.deleteEdge(e) directed edges adjacencyList is correct removes the edge a -> b and contains other vertices still in the list of a
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BooleanLiteral
src/models/AdjacencyList/AdjacencyList.ts:38:58
 
     deleteEdge(edge: Edge<V>): void {
         const vertexAList = this._adjacencyList.get(edge.vertexA) ?? [];
-        const newVertexAList = vertexAList.filter((x) => !x.equals(edge.vertexB));
+        const newVertexAList = vertexAList.filter((x) => x.equals(edge.vertexB));
         if (newVertexAList.length > 0) {
             this._adjacencyList.set(edge.vertexA, newVertexAList);
killedBy: graph.deleteEdge(e) directed edges adjacencyList is correct removes the edge a -> b and removes the entry of b in the list of a
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ArrowFunction
src/models/AdjacencyList/AdjacencyList.ts:38:51
 
     deleteEdge(edge: Edge<V>): void {
         const vertexAList = this._adjacencyList.get(edge.vertexA) ?? [];
-        const newVertexAList = vertexAList.filter((x) => !x.equals(edge.vertexB));
+        const newVertexAList = vertexAList.filter(() => undefined);
         if (newVertexAList.length > 0) {
             this._adjacencyList.set(edge.vertexA, newVertexAList);
killedBy: graph.deleteEdge(e) directed edges adjacencyList is correct removes the edge a -> b and contains other vertices still in the list of a
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] EqualityOperator
src/models/AdjacencyList/AdjacencyList.ts:39:13
     deleteEdge(edge: Edge<V>): void {
         const vertexAList = this._adjacencyList.get(edge.vertexA) ?? [];
         const newVertexAList = vertexAList.filter((x) => !x.equals(edge.vertexB));
-        if (newVertexAList.length > 0) {
+        if (newVertexAList.length <= 0) {
             this._adjacencyList.set(edge.vertexA, newVertexAList);
         } else {
killedBy: graph.deleteEdge(e) directed edges adjacencyList is correct removes the edge a -> b and contains other vertices still in the list of a
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
src/models/AdjacencyList/AdjacencyList.ts:39:13
     deleteEdge(edge: Edge<V>): void {
         const vertexAList = this._adjacencyList.get(edge.vertexA) ?? [];
         const newVertexAList = vertexAList.filter((x) => !x.equals(edge.vertexB));
-        if (newVertexAList.length > 0) {
+        if (false) {
             this._adjacencyList.set(edge.vertexA, newVertexAList);
         } else {
killedBy: graph.deleteEdge(e) directed edges adjacencyList is correct removes the edge a -> b and contains other vertices still in the list of a
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/models/AdjacencyList/AdjacencyList.ts:41:16
         const newVertexAList = vertexAList.filter((x) => !x.equals(edge.vertexB));
         if (newVertexAList.length > 0) {
             this._adjacencyList.set(edge.vertexA, newVertexAList);
-        } else {
-            this._adjacencyList.delete(edge.vertexA);
-        }
+        } else {}
 
         // Because it is about adjacency it must be done for both directed and undirected edges
killedBy: graph.deleteEdge(e) Reproduce #24 2x WeightedUndirectedEdges (not equal) delete both
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 5

- Array []
+ Array [
+   NamedVertex {

[Killed] LogicalOperator
src/models/AdjacencyList/AdjacencyList.ts:46:29
         }
 
         // Because it is about adjacency it must be done for both directed and undirected edges
-        const vertexBList = this._adjacencyList.get(edge.vertexB) ?? [];
+        const vertexBList = this._adjacencyList.get(edge.vertexB) && [];
         const newVertexBList = vertexBList.filter((x) => !x.equals(edge.vertexA));
         if (newVertexBList.length > 0) {
killedBy: graph.deleteEdge(e) directed edges adjacencyList is correct removes the edge a -> b and contains other vertices still in the list of b
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[NoCoverage] ArrayDeclaration
src/models/AdjacencyList/AdjacencyList.ts:46:70
         }
 
         // Because it is about adjacency it must be done for both directed and undirected edges
-        const vertexBList = this._adjacencyList.get(edge.vertexB) ?? [];
+        const vertexBList = this._adjacencyList.get(edge.vertexB) ?? ["Stryker was here"];
         const newVertexBList = vertexBList.filter((x) => !x.equals(edge.vertexA));
         if (newVertexBList.length > 0) {

[Killed] BooleanLiteral
src/models/AdjacencyList/AdjacencyList.ts:47:58
 
         // Because it is about adjacency it must be done for both directed and undirected edges
         const vertexBList = this._adjacencyList.get(edge.vertexB) ?? [];
-        const newVertexBList = vertexBList.filter((x) => !x.equals(edge.vertexA));
+        const newVertexBList = vertexBList.filter((x) => x.equals(edge.vertexA));
         if (newVertexBList.length > 0) {
             this._adjacencyList.set(edge.vertexB, newVertexBList);
killedBy: AdjacencyList deleting a directed edge deletes does not delete other adjacencies
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
src/models/AdjacencyList/AdjacencyList.ts:47:51
 
         // Because it is about adjacency it must be done for both directed and undirected edges
         const vertexBList = this._adjacencyList.get(edge.vertexB) ?? [];
-        const newVertexBList = vertexBList.filter((x) => !x.equals(edge.vertexA));
+        const newVertexBList = vertexBList.filter(() => undefined);
         if (newVertexBList.length > 0) {
             this._adjacencyList.set(edge.vertexB, newVertexBList);
killedBy: graph.deleteEdge(e) directed edges adjacencyList is correct removes the edge a -> b and contains other vertices still in the list of b
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
src/models/AdjacencyList/AdjacencyList.ts:48:13
         // Because it is about adjacency it must be done for both directed and undirected edges
         const vertexBList = this._adjacencyList.get(edge.vertexB) ?? [];
         const newVertexBList = vertexBList.filter((x) => !x.equals(edge.vertexA));
-        if (newVertexBList.length > 0) {
+        if (false) {
             this._adjacencyList.set(edge.vertexB, newVertexBList);
         } else {
killedBy: graph.deleteEdge(e) directed edges adjacencyList is correct removes the edge a -> b and contains other vertices still in the list of b
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/models/AdjacencyList/AdjacencyList.ts:48:40
         // Because it is about adjacency it must be done for both directed and undirected edges
         const vertexBList = this._adjacencyList.get(edge.vertexB) ?? [];
         const newVertexBList = vertexBList.filter((x) => !x.equals(edge.vertexA));
-        if (newVertexBList.length > 0) {
-            this._adjacencyList.set(edge.vertexB, newVertexBList);
-        } else {
+        if (newVertexBList.length > 0) {} else {
             this._adjacencyList.delete(edge.vertexB);
         }
killedBy: graph.deleteEdge(e) directed edges adjacencyList is correct removes the edge a -> b and removes the entry of a in the list of b
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] BlockStatement
src/models/AdjacencyList/AdjacencyList.ts:50:16
         const newVertexBList = vertexBList.filter((x) => !x.equals(edge.vertexA));
         if (newVertexBList.length > 0) {
             this._adjacencyList.set(edge.vertexB, newVertexBList);
-        } else {
-            this._adjacencyList.delete(edge.vertexB);
-        }
+        } else {}
     }
 }
killedBy: graph.deleteEdge(e) Reproduce #24 2x WeightedUndirectedEdges (not equal) delete both
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 5

- Array []
+ Array [
+   NamedVertex {
