[NoCoverage] BlockStatement
models/Edge/DirectedEdge/DirectedEdge.ts:8:19
 export class DirectedEdge<V extends Vertex> extends Edge<V> {
     protected _type: string = 'DirectedEdge';
 
-    get from(): V {
-        return this.vertexA;
-    }
+    get from(): V {}
 
     get to(): V {

[NoCoverage] BlockStatement
models/Edge/DirectedEdge/DirectedEdge.ts:12:17
         return this.vertexA;
     }
 
-    get to(): V {
-        return this.vertexB;
-    }
+    get to(): V {}
 
     isDirected(): boolean {

[Killed] BlockStatement
models/Edge/DirectedEdge/DirectedEdge.ts:16:27
         return this.vertexB;
     }
 
-    isDirected(): boolean {
-        return true;
-    }
+    isDirected(): boolean {}
 
     equals(other: Hashable): boolean {
killedBy: graph.deleteEdge(e) directed edges graph is initially as expected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
models/Edge/DirectedEdge/DirectedEdge.ts:17:16
     }
 
     isDirected(): boolean {
-        return true;
+        return false;
     }
 
killedBy: graph.deleteEdge(e) directed edges graph is initially as expected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
models/Edge/DirectedEdge/DirectedEdge.ts:20:38
         return true;
     }
 
-    equals(other: Hashable): boolean {
-        if (!(other instanceof DirectedEdge)) return false;
-        if (this._type !== other._type) return false;
-
-        return this.isEqualDirectedEdge(other);
-    }
+    equals(other: Hashable): boolean {}
 
     protected isEqualDirectedEdge(other: DirectedEdge<V>): boolean {
killedBy: DirectedEdge keeps Hashable Contract
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "The following object violated the reflexivity contract property of equals:·
{
	\"vertexA\": {
		\"name\": \"a\"
	},

[Killed] ConditionalExpression
models/Edge/DirectedEdge/DirectedEdge.ts:21:13
     }
 
     equals(other: Hashable): boolean {
-        if (!(other instanceof DirectedEdge)) return false;
+        if (true) return false;
         if (this._type !== other._type) return false;
 
killedBy: DirectedEdge keeps Hashable Contract
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "The following object violated the reflexivity contract property of equals:·
{
	\"vertexA\": {
		\"name\": \"a\"
	},

[Killed] BooleanLiteral
models/Edge/DirectedEdge/DirectedEdge.ts:21:54
     }
 
     equals(other: Hashable): boolean {
-        if (!(other instanceof DirectedEdge)) return false;
+        if (!(other instanceof DirectedEdge)) return true;
         if (this._type !== other._type) return false;
 
killedBy: DirectedEdge equals() return false for UndirectedEdge
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] ConditionalExpression
models/Edge/DirectedEdge/DirectedEdge.ts:22:13
 
     equals(other: Hashable): boolean {
         if (!(other instanceof DirectedEdge)) return false;
-        if (this._type !== other._type) return false;
+        if (false) return false;
 
         return this.isEqualDirectedEdge(other);
killedBy: graph.deleteEdge(e) Reproduce #24 1x WeightedDirectedEdges 1xDirectedEdge (same direction, not equal) delete 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
models/Edge/DirectedEdge/DirectedEdge.ts:22:13
 
     equals(other: Hashable): boolean {
         if (!(other instanceof DirectedEdge)) return false;
-        if (this._type !== other._type) return false;
+        if (true) return false;
 
         return this.isEqualDirectedEdge(other);
killedBy: WeightedDirectedEdge holds hashable contract
statusReason: Error: The following object violated the reflexivity contract property of equals: 
{
	"vertexA": {
		"name": "a"
	},
	"vertexB": {
		"name": "b"
	},

[Killed] BlockStatement
models/Edge/DirectedEdge/DirectedEdge.ts:27:68
         return this.isEqualDirectedEdge(other);
     }
 
-    protected isEqualDirectedEdge(other: DirectedEdge<V>): boolean {
-        if (this.isDirected() !== other.isDirected()) return false;
-
-        return this.vertexA.equals(other.vertexA) && this.vertexB.equals(other.vertexB);
-    }
+    protected isEqualDirectedEdge(other: DirectedEdge<V>): boolean {}
 
     hashCode(): number {
killedBy: WeightedDirectedEdge equals() returns false for its inverse
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: undefined

[Killed] BooleanLiteral
models/Edge/DirectedEdge/DirectedEdge.ts:28:62
     }
 
     protected isEqualDirectedEdge(other: DirectedEdge<V>): boolean {
-        if (this.isDirected() !== other.isDirected()) return false;
+        if (this.isDirected() !== other.isDirected()) return true;
 
         return this.vertexA.equals(other.vertexA) && this.vertexB.equals(other.vertexB);
killedBy: DirectedEdge equals() return false when messing with the isDirected return value
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] EqualityOperator
models/Edge/DirectedEdge/DirectedEdge.ts:28:13
     }
 
     protected isEqualDirectedEdge(other: DirectedEdge<V>): boolean {
-        if (this.isDirected() !== other.isDirected()) return false;
+        if (this.isDirected() === other.isDirected()) return false;
 
         return this.vertexA.equals(other.vertexA) && this.vertexB.equals(other.vertexB);
killedBy: WeightedDirectedEdge equals() returns true for itself
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
models/Edge/DirectedEdge/DirectedEdge.ts:30:16
     protected isEqualDirectedEdge(other: DirectedEdge<V>): boolean {
         if (this.isDirected() !== other.isDirected()) return false;
 
-        return this.vertexA.equals(other.vertexA) && this.vertexB.equals(other.vertexB);
+        return false;
     }
 
killedBy: graph.deleteEdge(e) directed edges edge list is correct removes the edge a -> b and receives the correct edge count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] LogicalOperator
models/Edge/DirectedEdge/DirectedEdge.ts:30:16
     protected isEqualDirectedEdge(other: DirectedEdge<V>): boolean {
         if (this.isDirected() !== other.isDirected()) return false;
 
-        return this.vertexA.equals(other.vertexA) && this.vertexB.equals(other.vertexB);
+        return this.vertexA.equals(other.vertexA) || this.vertexB.equals(other.vertexB);
     }
 
killedBy: DirectedEdge keeps Hashable Contract
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "The following objects violated the transitivity contract property of equals:·
{
	\"vertexA\": {
		\"name\": \"a\"
	},

[Killed] BlockStatement
models/Edge/DirectedEdge/DirectedEdge.ts:33:24
         return this.vertexA.equals(other.vertexA) && this.vertexB.equals(other.vertexB);
     }
 
-    hashCode(): number {
-        // tslint:disable-next-line:no-bitwise
-        return (this.vertexA.hashCode() << 24) - (this.vertexB.hashCode() << 8);
-    }
+    hashCode(): number {}
 }
 
killedBy: WeightedDirectedEdge hashCode() differs for the same vertices but different weights
statusReason: Error: expect(received).not.toEqual(expected) // deep equality

Expected: not NaN

[Survived] ArithmeticOperator
models/Edge/DirectedEdge/DirectedEdge.ts:35:16
 
     hashCode(): number {
         // tslint:disable-next-line:no-bitwise
-        return (this.vertexA.hashCode() << 24) - (this.vertexB.hashCode() << 8);
+        return (this.vertexA.hashCode() << 24) + (this.vertexB.hashCode() << 8);
     }
 }
