[Survived] BooleanLiteral
src/models/Graph/Graph.ts:35:54
      * of vertices. If true it will add unknown vertices. If false it will throw an VertexNotFoundError when trying to add edges with unknown
      * vertices.
      */
-    constructor(addUnknownVerticesInEdges: boolean = false) {
+    constructor(addUnknownVerticesInEdges: boolean = true) {
         this._listOfEdges = [];
         this._listOfVertices = [];

[Killed] BlockStatement
src/models/Graph/Graph.ts:50:44
      *
      * @param vertex The vertex / vertices to be added. Duplicates are only processed once.
      */
-    addVertex(...vertex: V[]): Graph<V, E> {
-        const uniqueVertices = new MutableHashSet<V>();
-        const setOfGraphVertices = new MutableHashSet<V>();
-
-        vertex.forEach((x) => uniqueVertices.add(x));
-        this._listOfVertices.forEach((x) => setOfGraphVertices.add(x));
-
-        const filteredVertices = uniqueVertices.difference(setOfGraphVertices).toArray();
-
-        filteredVertices.forEach((singleVertex) => {
-            this._listOfVertices.push(singleVertex);
-        });
-
-        return this;
-    }
+    addVertex(...vertex: V[]): Graph<V, E> {}
 
     /**
killedBy: Test retrieving attached, incoming and outgoing edges for a vertex g.getAttachedEdges(v) works with a directed graph
statusReason: Error: Vertex {"name":"c"} not found in graph.

[Killed] ArrowFunction
src/models/Graph/Graph.ts:54:24
         const uniqueVertices = new MutableHashSet<V>();
         const setOfGraphVertices = new MutableHashSet<V>();
 
-        vertex.forEach((x) => uniqueVertices.add(x));
+        vertex.forEach(() => undefined);
         this._listOfVertices.forEach((x) => setOfGraphVertices.add(x));
 
killedBy: graph.deleteEdge(e) directed edges graph is initially as expected
statusReason: Error: Vertex {"name":"a"} not found in graph.

[Survived] ArrowFunction
src/models/Graph/Graph.ts:55:38
         const setOfGraphVertices = new MutableHashSet<V>();
 
         vertex.forEach((x) => uniqueVertices.add(x));
-        this._listOfVertices.forEach((x) => setOfGraphVertices.add(x));
+        this._listOfVertices.forEach(() => undefined);
 
         const filteredVertices = uniqueVertices.difference(setOfGraphVertices).toArray();

[Killed] BlockStatement
src/models/Graph/Graph.ts:59:52
 
         const filteredVertices = uniqueVertices.difference(setOfGraphVertices).toArray();
 
-        filteredVertices.forEach((singleVertex) => {
-            this._listOfVertices.push(singleVertex);
-        });
+        filteredVertices.forEach((singleVertex) => {});
 
         return this;
killedBy: graph.deleteVertex(v) graph is initially as expected
statusReason: Error: Vertex {"name":"a"} not found in graph.

[Killed] BlockStatement
src/models/Graph/Graph.ts:72:47
      *
      * @param vertex The vertex / vertices to be removed. Duplicates are only processed once.
      */
-    deleteVertex(...vertex: V[]): Graph<V, E> {
-        const uniqueVertices = new MutableHashSet<V>();
-        const setOfGraphVertices = new MutableHashSet<V>();
-
-        vertex.forEach((x) => uniqueVertices.add(x));
-        this._listOfVertices.forEach((x) => setOfGraphVertices.add(x));
-
-        const filteredVertices = uniqueVertices.intersection(setOfGraphVertices).toArray();
-        filteredVertices.forEach((singleVertex) => {
-            this._listOfVertices = this._listOfVertices.filter((x) => !x.equals(singleVertex));
-            this._listOfEdges = this._listOfEdges.filter(
-                (x) => !x.vertexA.equals(singleVertex) && !x.vertexB.equals(singleVertex)
-            );
-
-            this._adjacencyMatrix.deleteVertex(singleVertex);
-
-            this._adjacencyList.deleteVertex(singleVertex);
-        });
-
-        return this;
-    }
+    deleteVertex(...vertex: V[]): Graph<V, E> {}
 
     /**
killedBy: graph.deleteVertex(v) vertex list is correct removes the vertex a from the vertex list
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 4

[Killed] BlockStatement
src/models/Graph/Graph.ts:80:52
         this._listOfVertices.forEach((x) => setOfGraphVertices.add(x));
 
         const filteredVertices = uniqueVertices.intersection(setOfGraphVertices).toArray();
-        filteredVertices.forEach((singleVertex) => {
-            this._listOfVertices = this._listOfVertices.filter((x) => !x.equals(singleVertex));
-            this._listOfEdges = this._listOfEdges.filter(
-                (x) => !x.vertexA.equals(singleVertex) && !x.vertexB.equals(singleVertex)
-            );
-
-            this._adjacencyMatrix.deleteVertex(singleVertex);
-
-            this._adjacencyList.deleteVertex(singleVertex);
-        });
+        filteredVertices.forEach((singleVertex) => {});
 
         return this;
killedBy: graph.deleteVertex(v) vertex list is correct removes the vertex a from the vertex list
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 4

[Killed] ArrowFunction
src/models/Graph/Graph.ts:81:64
 
         const filteredVertices = uniqueVertices.intersection(setOfGraphVertices).toArray();
         filteredVertices.forEach((singleVertex) => {
-            this._listOfVertices = this._listOfVertices.filter((x) => !x.equals(singleVertex));
+            this._listOfVertices = this._listOfVertices.filter(() => undefined);
             this._listOfEdges = this._listOfEdges.filter(
                 (x) => !x.vertexA.equals(singleVertex) && !x.vertexB.equals(singleVertex)
killedBy: graph.deleteVertex(v) vertex list is correct removes the vertex a from the vertex list
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] BooleanLiteral
src/models/Graph/Graph.ts:81:71
 
         const filteredVertices = uniqueVertices.intersection(setOfGraphVertices).toArray();
         filteredVertices.forEach((singleVertex) => {
-            this._listOfVertices = this._listOfVertices.filter((x) => !x.equals(singleVertex));
+            this._listOfVertices = this._listOfVertices.filter((x) => x.equals(singleVertex));
             this._listOfEdges = this._listOfEdges.filter(
                 (x) => !x.vertexA.equals(singleVertex) && !x.vertexB.equals(singleVertex)
killedBy: graph.deleteVertex(v) vertex list is correct removes the vertex a from the vertex list
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1

[Killed] BooleanLiteral
src/models/Graph/Graph.ts:83:24
         filteredVertices.forEach((singleVertex) => {
             this._listOfVertices = this._listOfVertices.filter((x) => !x.equals(singleVertex));
             this._listOfEdges = this._listOfEdges.filter(
-                (x) => !x.vertexA.equals(singleVertex) && !x.vertexB.equals(singleVertex)
+                (x) => x.vertexA.equals(singleVertex) && !x.vertexB.equals(singleVertex)
             );
 
killedBy: graph.deleteVertex(v) edge list is correct removes the vertex a and receives the correct edge count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] BooleanLiteral
src/models/Graph/Graph.ts:83:59
         filteredVertices.forEach((singleVertex) => {
             this._listOfVertices = this._listOfVertices.filter((x) => !x.equals(singleVertex));
             this._listOfEdges = this._listOfEdges.filter(
-                (x) => !x.vertexA.equals(singleVertex) && !x.vertexB.equals(singleVertex)
+                (x) => !x.vertexA.equals(singleVertex) && x.vertexB.equals(singleVertex)
             );
 
killedBy: graph.deleteVertex(v) edge list is correct removes the vertex a and receives the correct edge count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArrowFunction
src/models/Graph/Graph.ts:107:22
         const uniqueEdges = new MutableHashSet<E>();
         const setOfGraphEdges = new MutableHashSet<E>();
 
-        edge.forEach((x) => uniqueEdges.add(x));
+        edge.forEach(() => undefined);
         this._listOfEdges.forEach((x) => setOfGraphEdges.add(x));
 
killedBy: Test retrieving attached, incoming and outgoing edges for a vertex g.getAttachedEdges(v) works with a directed graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 47
+ Received  +  1

- Array [
-   DirectedEdge {
-     "_type": "DirectedEdge",

[Survived] ArrowFunction
src/models/Graph/Graph.ts:108:35
         const setOfGraphEdges = new MutableHashSet<E>();
 
         edge.forEach((x) => uniqueEdges.add(x));
-        this._listOfEdges.forEach((x) => setOfGraphEdges.add(x));
+        this._listOfEdges.forEach(() => undefined);
 
         const filteredEdges = uniqueEdges.difference(setOfGraphEdges).toArray();

[Killed] BooleanLiteral
src/models/Graph/Graph.ts:112:13
 
         const filteredEdges = uniqueEdges.difference(setOfGraphEdges).toArray();
 
-        if (!this.addUnknownVerticesInEdges)
+        if (this.addUnknownVerticesInEdges)
             filteredEdges.forEach((singleEdge) => this.validateEdgeVerticesAreContainedInGraph(singleEdge));
         else filteredEdges.forEach((singleEdge) => this.addVertex(singleEdge.vertexA, singleEdge.vertexB));
killedBy: g.getStronglyConnectedComponent() Normal Cases Works with directed edges
statusReason: Error: Vertex {"name":"a"} not found in graph.

[Killed] ConditionalExpression
src/models/Graph/Graph.ts:112:13
 
         const filteredEdges = uniqueEdges.difference(setOfGraphEdges).toArray();
 
-        if (!this.addUnknownVerticesInEdges)
+        if (true)
             filteredEdges.forEach((singleEdge) => this.validateEdgeVerticesAreContainedInGraph(singleEdge));
         else filteredEdges.forEach((singleEdge) => this.addVertex(singleEdge.vertexA, singleEdge.vertexB));
killedBy: g.getEdges(a, b) it finds a directed edge when given the same order
statusReason: Error: Vertex {"name":"a"} not found in graph.

[Survived] ArrowFunction
src/models/Graph/Graph.ts:113:35
         const filteredEdges = uniqueEdges.difference(setOfGraphEdges).toArray();
 
         if (!this.addUnknownVerticesInEdges)
-            filteredEdges.forEach((singleEdge) => this.validateEdgeVerticesAreContainedInGraph(singleEdge));
+            filteredEdges.forEach(() => undefined);
         else filteredEdges.forEach((singleEdge) => this.addVertex(singleEdge.vertexA, singleEdge.vertexB));
 

[Killed] ArrowFunction
src/models/Graph/Graph.ts:114:36
 
         if (!this.addUnknownVerticesInEdges)
             filteredEdges.forEach((singleEdge) => this.validateEdgeVerticesAreContainedInGraph(singleEdge));
-        else filteredEdges.forEach((singleEdge) => this.addVertex(singleEdge.vertexA, singleEdge.vertexB));
+        else filteredEdges.forEach(() => undefined);
 
         filteredEdges.forEach((singleEdge) => {
killedBy: g.getChildNodes(v) Normal Cases Graph has fewer vertices than edges Works correctly with a directed Graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   NamedVertex {
-     "name": "b",

[Killed] BlockStatement
src/models/Graph/Graph.ts:116:47
             filteredEdges.forEach((singleEdge) => this.validateEdgeVerticesAreContainedInGraph(singleEdge));
         else filteredEdges.forEach((singleEdge) => this.addVertex(singleEdge.vertexA, singleEdge.vertexB));
 
-        filteredEdges.forEach((singleEdge) => {
-            this._listOfEdges.push(singleEdge);
-
-            this._adjacencyMatrix.set(singleEdge.vertexA, singleEdge.vertexB, true);
-            this._adjacencyList.addAdjacency(singleEdge.vertexA, singleEdge.vertexB);
-
-            if (!singleEdge.isDirected()) {
-                this._adjacencyMatrix.set(singleEdge.vertexB, singleEdge.vertexA, true);
-            }
-        });
+        filteredEdges.forEach((singleEdge) => {});
 
         return this;
killedBy: g.getChildNodes(v) Normal Cases Graph has fewer vertices than edges Works correctly with a directed Graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   NamedVertex {
-     "name": "b",

[Killed] BooleanLiteral
src/models/Graph/Graph.ts:119:79
         filteredEdges.forEach((singleEdge) => {
             this._listOfEdges.push(singleEdge);
 
-            this._adjacencyMatrix.set(singleEdge.vertexA, singleEdge.vertexB, true);
+            this._adjacencyMatrix.set(singleEdge.vertexA, singleEdge.vertexB, false);
             this._adjacencyList.addAdjacency(singleEdge.vertexA, singleEdge.vertexB);
 
killedBy: g.getChildNodes(v) Normal Cases Graph has more edges than vertices Works correctly with a directed Graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   NamedVertex {
-     "name": "b",

[Killed] ConditionalExpression
src/models/Graph/Graph.ts:122:17
             this._adjacencyMatrix.set(singleEdge.vertexA, singleEdge.vertexB, true);
             this._adjacencyList.addAdjacency(singleEdge.vertexA, singleEdge.vertexB);
 
-            if (!singleEdge.isDirected()) {
+            if (false) {
                 this._adjacencyMatrix.set(singleEdge.vertexB, singleEdge.vertexA, true);
             }
killedBy: g.getChildNodes(v) Edge Cases Graph has fewer vertices than edges Works does not add duplicate vetices
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Array [
    NamedVertex {
      "name": "b",

[Killed] BlockStatement
src/models/Graph/Graph.ts:122:43
             this._adjacencyMatrix.set(singleEdge.vertexA, singleEdge.vertexB, true);
             this._adjacencyList.addAdjacency(singleEdge.vertexA, singleEdge.vertexB);
 
-            if (!singleEdge.isDirected()) {
-                this._adjacencyMatrix.set(singleEdge.vertexB, singleEdge.vertexA, true);
-            }
+            if (!singleEdge.isDirected()) {}
         });
 
killedBy: g.getChildNodes(v) Edge Cases Graph has fewer vertices than edges Works does not add duplicate vetices
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

  Array [
    NamedVertex {
      "name": "b",

[Killed] BooleanLiteral
src/models/Graph/Graph.ts:123:83
             this._adjacencyList.addAdjacency(singleEdge.vertexA, singleEdge.vertexB);
 
             if (!singleEdge.isDirected()) {
-                this._adjacencyMatrix.set(singleEdge.vertexB, singleEdge.vertexA, true);
+                this._adjacencyMatrix.set(singleEdge.vertexB, singleEdge.vertexA, false);
             }
         });
killedBy: graph.deleteEdge(e) undirected edges graph is initially as expected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/models/Graph/Graph.ts:144:47
         this._listOfEdges.forEach((x) => setOfGraphEdges.add(x));
 
         const filteredEdges = uniqueEdges.intersection(setOfGraphEdges).toArray();
-        filteredEdges.forEach((singleEdge) => {
-            this._listOfEdges = this._listOfEdges.filter((x) => !x.equals(singleEdge));
-
-            const givenDirectionExists = this.getEdges(singleEdge.vertexA, singleEdge.vertexB).length > 0;
-            const inverseDirectionExists = this.getEdges(singleEdge.vertexB, singleEdge.vertexA).length > 0;
-            // Only remove from adjacency matrix if no such edge connection (considering direction) exists
-            if (!givenDirectionExists) {
-                this._adjacencyMatrix.set(singleEdge.vertexA, singleEdge.vertexB, false);
-            }
-
-            if (!inverseDirectionExists) {
-                this._adjacencyMatrix.set(singleEdge.vertexB, singleEdge.vertexA, false);
-            }
-
-            if (!givenDirectionExists && !inverseDirectionExists) {
-                this._adjacencyList.deleteEdge(singleEdge);
-            }
-        });
+        filteredEdges.forEach((singleEdge) => {});
 
         return this;
killedBy: graph.deleteEdge(e) directed edges edge list is correct removes the edge a -> b and receives the correct edge count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] ArrowFunction
src/models/Graph/Graph.ts:145:58
 
         const filteredEdges = uniqueEdges.intersection(setOfGraphEdges).toArray();
         filteredEdges.forEach((singleEdge) => {
-            this._listOfEdges = this._listOfEdges.filter((x) => !x.equals(singleEdge));
+            this._listOfEdges = this._listOfEdges.filter(() => undefined);
 
             const givenDirectionExists = this.getEdges(singleEdge.vertexA, singleEdge.vertexB).length > 0;
killedBy: graph.deleteEdge(e) directed edges edge list is correct removes the edge a -> b and receives the correct edge count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] BooleanLiteral
src/models/Graph/Graph.ts:145:65
 
         const filteredEdges = uniqueEdges.intersection(setOfGraphEdges).toArray();
         filteredEdges.forEach((singleEdge) => {
-            this._listOfEdges = this._listOfEdges.filter((x) => !x.equals(singleEdge));
+            this._listOfEdges = this._listOfEdges.filter((x) => x.equals(singleEdge));
 
             const givenDirectionExists = this.getEdges(singleEdge.vertexA, singleEdge.vertexB).length > 0;
killedBy: graph.deleteEdge(e) directed edges edge list is correct removes the edge a -> b and receives the correct edge count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] EqualityOperator
src/models/Graph/Graph.ts:147:42
         filteredEdges.forEach((singleEdge) => {
             this._listOfEdges = this._listOfEdges.filter((x) => !x.equals(singleEdge));
 
-            const givenDirectionExists = this.getEdges(singleEdge.vertexA, singleEdge.vertexB).length > 0;
+            const givenDirectionExists = this.getEdges(singleEdge.vertexA, singleEdge.vertexB).length <= 0;
             const inverseDirectionExists = this.getEdges(singleEdge.vertexB, singleEdge.vertexA).length > 0;
             // Only remove from adjacency matrix if no such edge connection (considering direction) exists
killedBy: graph.deleteEdge(e) directed edges adjacencyList is correct removes the edge a -> b and removes the entry of b in the list of a
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
src/models/Graph/Graph.ts:147:42
         filteredEdges.forEach((singleEdge) => {
             this._listOfEdges = this._listOfEdges.filter((x) => !x.equals(singleEdge));
 
-            const givenDirectionExists = this.getEdges(singleEdge.vertexA, singleEdge.vertexB).length > 0;
+            const givenDirectionExists = false;
             const inverseDirectionExists = this.getEdges(singleEdge.vertexB, singleEdge.vertexA).length > 0;
             // Only remove from adjacency matrix if no such edge connection (considering direction) exists
killedBy: graph.deleteEdge(e) Reproduce #24 2x WeightedUndirectedEdges (not equal) delete 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] EqualityOperator
src/models/Graph/Graph.ts:148:44
             this._listOfEdges = this._listOfEdges.filter((x) => !x.equals(singleEdge));
 
             const givenDirectionExists = this.getEdges(singleEdge.vertexA, singleEdge.vertexB).length > 0;
-            const inverseDirectionExists = this.getEdges(singleEdge.vertexB, singleEdge.vertexA).length > 0;
+            const inverseDirectionExists = this.getEdges(singleEdge.vertexB, singleEdge.vertexA).length <= 0;
             // Only remove from adjacency matrix if no such edge connection (considering direction) exists
             if (!givenDirectionExists) {
killedBy: graph.deleteEdge(e) directed edges adjacencyList is correct removes the edge a -> b and removes the entry of b in the list of a
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] EqualityOperator
src/models/Graph/Graph.ts:148:44
             this._listOfEdges = this._listOfEdges.filter((x) => !x.equals(singleEdge));
 
             const givenDirectionExists = this.getEdges(singleEdge.vertexA, singleEdge.vertexB).length > 0;
-            const inverseDirectionExists = this.getEdges(singleEdge.vertexB, singleEdge.vertexA).length > 0;
+            const inverseDirectionExists = this.getEdges(singleEdge.vertexB, singleEdge.vertexA).length >= 0;
             // Only remove from adjacency matrix if no such edge connection (considering direction) exists
             if (!givenDirectionExists) {
killedBy: graph.deleteEdge(e) directed edges adjacencyList is correct removes the edge a -> b and removes the entry of b in the list of a
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
src/models/Graph/Graph.ts:150:17
             const givenDirectionExists = this.getEdges(singleEdge.vertexA, singleEdge.vertexB).length > 0;
             const inverseDirectionExists = this.getEdges(singleEdge.vertexB, singleEdge.vertexA).length > 0;
             // Only remove from adjacency matrix if no such edge connection (considering direction) exists
-            if (!givenDirectionExists) {
+            if (false) {
                 this._adjacencyMatrix.set(singleEdge.vertexA, singleEdge.vertexB, false);
             }
killedBy: graph.deleteEdge(e) directed edges adjacencyMatrix is correct removes the edge a -> b and sets the deleted edge to false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/models/Graph/Graph.ts:150:40
             const givenDirectionExists = this.getEdges(singleEdge.vertexA, singleEdge.vertexB).length > 0;
             const inverseDirectionExists = this.getEdges(singleEdge.vertexB, singleEdge.vertexA).length > 0;
             // Only remove from adjacency matrix if no such edge connection (considering direction) exists
-            if (!givenDirectionExists) {
-                this._adjacencyMatrix.set(singleEdge.vertexA, singleEdge.vertexB, false);
-            }
+            if (!givenDirectionExists) {}
 
             if (!inverseDirectionExists) {
killedBy: graph.deleteEdge(e) directed edges adjacencyMatrix is correct removes the edge a -> b and sets the deleted edge to false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/models/Graph/Graph.ts:151:83
             const inverseDirectionExists = this.getEdges(singleEdge.vertexB, singleEdge.vertexA).length > 0;
             // Only remove from adjacency matrix if no such edge connection (considering direction) exists
             if (!givenDirectionExists) {
-                this._adjacencyMatrix.set(singleEdge.vertexA, singleEdge.vertexB, false);
+                this._adjacencyMatrix.set(singleEdge.vertexA, singleEdge.vertexB, true);
             }
 
killedBy: graph.deleteEdge(e) directed edges adjacencyMatrix is correct removes the edge a -> b and sets the deleted edge to false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/models/Graph/Graph.ts:154:17
                 this._adjacencyMatrix.set(singleEdge.vertexA, singleEdge.vertexB, false);
             }
 
-            if (!inverseDirectionExists) {
+            if (true) {
                 this._adjacencyMatrix.set(singleEdge.vertexB, singleEdge.vertexA, false);
             }
killedBy: graph.deleteEdge(e) Reproduce #24 2x WeightedUndirectedEdges (not equal) delete 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BlockStatement
src/models/Graph/Graph.ts:154:42
                 this._adjacencyMatrix.set(singleEdge.vertexA, singleEdge.vertexB, false);
             }
 
-            if (!inverseDirectionExists) {
-                this._adjacencyMatrix.set(singleEdge.vertexB, singleEdge.vertexA, false);
-            }
+            if (!inverseDirectionExists) {}
 
             if (!givenDirectionExists && !inverseDirectionExists) {
killedBy: graph.deleteEdge(e) undirected edges adjacencyMatrix is correct removes the edge a <-> b and sets the deleted edge to false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/models/Graph/Graph.ts:155:83
             }
 
             if (!inverseDirectionExists) {
-                this._adjacencyMatrix.set(singleEdge.vertexB, singleEdge.vertexA, false);
+                this._adjacencyMatrix.set(singleEdge.vertexB, singleEdge.vertexA, true);
             }
 
killedBy: graph.deleteEdge(e) directed edges adjacencyMatrix is correct removes the edge a -> b and all non-existent edges are still false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] LogicalOperator
src/models/Graph/Graph.ts:158:17
                 this._adjacencyMatrix.set(singleEdge.vertexB, singleEdge.vertexA, false);
             }
 
-            if (!givenDirectionExists && !inverseDirectionExists) {
+            if (!givenDirectionExists || !inverseDirectionExists) {
                 this._adjacencyList.deleteEdge(singleEdge);
             }
killedBy: graph.deleteEdge(e) Reproduce #24 2x WeightedDirectedEdges (opposite direction, not equal) delete 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Array [
-   NamedVertex {
-     "name": "b",

[Killed] ConditionalExpression
src/models/Graph/Graph.ts:158:17
                 this._adjacencyMatrix.set(singleEdge.vertexB, singleEdge.vertexA, false);
             }
 
-            if (!givenDirectionExists && !inverseDirectionExists) {
+            if (false) {
                 this._adjacencyList.deleteEdge(singleEdge);
             }
killedBy: graph.deleteEdge(e) directed edges adjacencyList is correct removes the edge a -> b and removes the entry of b in the list of a
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[NoCoverage] BlockStatement
src/models/Graph/Graph.ts:171:44
      *
      * @param vertex The vertex which adjacent vertices should be found.
      */
-    getAdjacentVerticesFor(vertex: V): V[] {
-        return this.getAdjacencyList().getAdjacentVertices(vertex);
-    }
+    getAdjacentVerticesFor(vertex: V): V[] {}
 
     /**

[Killed] BlockStatement
src/models/Graph/Graph.ts:180:38
      *
      * @param vertex The vertex which child vertices should be found.
      */
-    getChildVertices(vertex: V): V[] {
-        const allEdges = this.getListOfEdges();
-        const allVertices = this.getListOfVertices();
-        let result: V[] = [];
-
-        // ToDo: Possible optimization: just return adjacency list for the node if graph is undirected (keep track with a property)
-
-        if (allEdges.length >= allVertices.length) {
-            const adjacencyMatrix = this.getAdjacencyMatrix();
-            result = allVertices.filter((maybeChild) => {
-                return adjacencyMatrix.get(vertex, maybeChild);
-            });
-        } else {
-            allEdges.forEach((singleEdge) => {
-                if (singleEdge.vertexA.equals(vertex)) result.push(singleEdge.vertexB);
-
-                if (!singleEdge.isDirected() && singleEdge.vertexB.equals(vertex)) result.push(singleEdge.vertexA);
-            });
-        }
-
-        const resultSet = new MutableHashSet<V>();
-        result.forEach((x) => resultSet.add(x));
-
-        return resultSet.toArray();
-    }
+    getChildVertices(vertex: V): V[] {}
 
     /**
killedBy: g.getChildNodes(v) Normal Cases Graph has fewer vertices than edges Works correctly with a directed Graph
statusReason: TypeError: Cannot read properties of undefined (reading 'sort')

[Killed] BlockStatement
src/models/Graph/Graph.ts:187:52
 
         // ToDo: Possible optimization: just return adjacency list for the node if graph is undirected (keep track with a property)
 
-        if (allEdges.length >= allVertices.length) {
-            const adjacencyMatrix = this.getAdjacencyMatrix();
-            result = allVertices.filter((maybeChild) => {
-                return adjacencyMatrix.get(vertex, maybeChild);
-            });
-        } else {
+        if (allEdges.length >= allVertices.length) {} else {
             allEdges.forEach((singleEdge) => {
                 if (singleEdge.vertexA.equals(vertex)) result.push(singleEdge.vertexB);
killedBy: g.getChildNodes(v) Normal Cases Graph has more edges than vertices Works correctly with a directed Graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   NamedVertex {
-     "name": "b",

[Survived] ConditionalExpression
src/models/Graph/Graph.ts:187:13
 
         // ToDo: Possible optimization: just return adjacency list for the node if graph is undirected (keep track with a property)
 
-        if (allEdges.length >= allVertices.length) {
+        if (false) {
             const adjacencyMatrix = this.getAdjacencyMatrix();
             result = allVertices.filter((maybeChild) => {
