[Killed] BlockStatement
src/models/Graph/Graph.ts:189:57
 
         if (allEdges.length >= allVertices.length) {
             const adjacencyMatrix = this.getAdjacencyMatrix();
-            result = allVertices.filter((maybeChild) => {
-                return adjacencyMatrix.get(vertex, maybeChild);
-            });
+            result = allVertices.filter((maybeChild) => {});
         } else {
             allEdges.forEach((singleEdge) => {
killedBy: g.getChildNodes(v) Normal Cases Graph has more edges than vertices Works correctly with a directed Graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   NamedVertex {
-     "name": "b",

[Killed] BlockStatement
src/models/Graph/Graph.ts:192:16
             result = allVertices.filter((maybeChild) => {
                 return adjacencyMatrix.get(vertex, maybeChild);
             });
-        } else {
-            allEdges.forEach((singleEdge) => {
-                if (singleEdge.vertexA.equals(vertex)) result.push(singleEdge.vertexB);
-
-                if (!singleEdge.isDirected() && singleEdge.vertexB.equals(vertex)) result.push(singleEdge.vertexA);
-            });
-        }
+        } else {}
 
         const resultSet = new MutableHashSet<V>();
killedBy: g.getChildNodes(v) Normal Cases Graph has fewer vertices than edges Works correctly with a directed Graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   NamedVertex {
-     "name": "b",

[Killed] BlockStatement
src/models/Graph/Graph.ts:193:46
                 return adjacencyMatrix.get(vertex, maybeChild);
             });
         } else {
-            allEdges.forEach((singleEdge) => {
-                if (singleEdge.vertexA.equals(vertex)) result.push(singleEdge.vertexB);
-
-                if (!singleEdge.isDirected() && singleEdge.vertexB.equals(vertex)) result.push(singleEdge.vertexA);
-            });
+            allEdges.forEach((singleEdge) => {});
         }
 
killedBy: g.getStronglyConnectedComponent() Normal Cases Works with undirected edges
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  4
+ Received  + 12

  Array [
    Array [
      NamedVertex {

[Killed] ConditionalExpression
src/models/Graph/Graph.ts:194:21
             });
         } else {
             allEdges.forEach((singleEdge) => {
-                if (singleEdge.vertexA.equals(vertex)) result.push(singleEdge.vertexB);
+                if (true) result.push(singleEdge.vertexB);
 
                 if (!singleEdge.isDirected() && singleEdge.vertexB.equals(vertex)) result.push(singleEdge.vertexA);
killedBy: g.getChildNodes(v) Normal Cases Graph has fewer vertices than edges Works correctly with a directed Graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 3

@@ -1,7 +1,10 @@
  Array [
    NamedVertex {

[Killed] ConditionalExpression
src/models/Graph/Graph.ts:194:21
             });
         } else {
             allEdges.forEach((singleEdge) => {
-                if (singleEdge.vertexA.equals(vertex)) result.push(singleEdge.vertexB);
+                if (false) result.push(singleEdge.vertexB);
 
                 if (!singleEdge.isDirected() && singleEdge.vertexB.equals(vertex)) result.push(singleEdge.vertexA);
killedBy: g.*dfsIterator() Normal Case Works for directed graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -1,14 +1,14 @@
  Array [
    NamedVertex {

[Killed] BooleanLiteral
src/models/Graph/Graph.ts:196:21
             allEdges.forEach((singleEdge) => {
                 if (singleEdge.vertexA.equals(vertex)) result.push(singleEdge.vertexB);
 
-                if (!singleEdge.isDirected() && singleEdge.vertexB.equals(vertex)) result.push(singleEdge.vertexA);
+                if (singleEdge.isDirected() && singleEdge.vertexB.equals(vertex)) result.push(singleEdge.vertexA);
             });
         }
killedBy: g.getChildNodes(v) Normal Cases Graph has fewer vertices than edges Works correctly with a directed Graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 3

@@ -3,6 +3,9 @@
      "name": "b",
    },

[Killed] ConditionalExpression
src/models/Graph/Graph.ts:196:21
             allEdges.forEach((singleEdge) => {
                 if (singleEdge.vertexA.equals(vertex)) result.push(singleEdge.vertexB);
 
-                if (!singleEdge.isDirected() && singleEdge.vertexB.equals(vertex)) result.push(singleEdge.vertexA);
+                if (true) result.push(singleEdge.vertexA);
             });
         }
killedBy: g.getChildNodes(v) Normal Cases Graph has fewer vertices than edges Works correctly with a directed Graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 6

  Array [
    NamedVertex {
+     "name": "a",

[Killed] ArrowFunction
src/models/Graph/Graph.ts:201:24
         }
 
         const resultSet = new MutableHashSet<V>();
-        result.forEach((x) => resultSet.add(x));
+        result.forEach(() => undefined);
 
         return resultSet.toArray();
killedBy: g.getChildNodes(v) Normal Cases Graph has fewer vertices than edges Works correctly with a directed Graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   NamedVertex {
-     "name": "b",

[Killed] BlockStatement
src/models/Graph/Graph.ts:211:38
      *
      * @param vertex The vertex which attached edges should be found.
      */
-    getAttachedEdges(vertex: V): E[] {
-        return this.getListOfEdges().filter(({ vertexA, vertexB }) => {
-            return vertexA.equals(vertex) || vertexB.equals(vertex);
-        });
-    }
+    getAttachedEdges(vertex: V): E[] {}
 
     /**
killedBy: Test retrieving attached, incoming and outgoing edges for a vertex g.getAttachedEdges(v) works with a directed graph
statusReason: TypeError: Cannot read properties of undefined (reading 'sort')

[Killed] BlockStatement
src/models/Graph/Graph.ts:212:71
      * @param vertex The vertex which attached edges should be found.
      */
     getAttachedEdges(vertex: V): E[] {
-        return this.getListOfEdges().filter(({ vertexA, vertexB }) => {
-            return vertexA.equals(vertex) || vertexB.equals(vertex);
-        });
+        return this.getListOfEdges().filter(({ vertexA, vertexB }) => {});
     }
 
killedBy: Test retrieving attached, incoming and outgoing edges for a vertex g.getAttachedEdges(v) works with a directed graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 47
+ Received  +  1

- Array [
-   DirectedEdge {
-     "_type": "DirectedEdge",

[Killed] ConditionalExpression
src/models/Graph/Graph.ts:213:20
      */
     getAttachedEdges(vertex: V): E[] {
         return this.getListOfEdges().filter(({ vertexA, vertexB }) => {
-            return vertexA.equals(vertex) || vertexB.equals(vertex);
+            return false;
         });
     }
killedBy: Test retrieving attached, incoming and outgoing edges for a vertex g.getAttachedEdges(v) works with a directed graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 47
+ Received  +  1

- Array [
-   DirectedEdge {
-     "_type": "DirectedEdge",

[Killed] LogicalOperator
src/models/Graph/Graph.ts:213:20
      */
     getAttachedEdges(vertex: V): E[] {
         return this.getListOfEdges().filter(({ vertexA, vertexB }) => {
-            return vertexA.equals(vertex) || vertexB.equals(vertex);
+            return vertexA.equals(vertex) && vertexB.equals(vertex);
         });
     }
killedBy: Test retrieving attached, incoming and outgoing edges for a vertex g.getAttachedEdges(v) works with a directed graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 36
+ Received  +  0

@@ -3,45 +3,9 @@
      "_type": "DirectedEdge",
      "vertexA": NamedVertex {

[Killed] BlockStatement
src/models/Graph/Graph.ts:223:38
      *
      * @param vertex The vertex which attached edges should be found.
      */
-    getOutgoingEdges(vertex: V): E[] {
-        return this.getListOfEdges().filter(({ vertexA, vertexB, isDirected }) => {
-            if (isDirected()) {
-                return vertexA.equals(vertex);
-            }
-
-            return vertexA.equals(vertex) || vertexB.equals(vertex);
-        });
-    }
+    getOutgoingEdges(vertex: V): E[] {}
 
     /**
killedBy: Test retrieving attached, incoming and outgoing edges for a vertex g.getOutgoingEdges(v) works with a directed graph
statusReason: TypeError: Cannot read properties of undefined (reading 'sort')

[Killed] BlockStatement
src/models/Graph/Graph.ts:224:83
      * @param vertex The vertex which attached edges should be found.
      */
     getOutgoingEdges(vertex: V): E[] {
-        return this.getListOfEdges().filter(({ vertexA, vertexB, isDirected }) => {
-            if (isDirected()) {
-                return vertexA.equals(vertex);
-            }
-
-            return vertexA.equals(vertex) || vertexB.equals(vertex);
-        });
+        return this.getListOfEdges().filter(({ vertexA, vertexB, isDirected }) => {});
     }
 
killedBy: Test retrieving attached, incoming and outgoing edges for a vertex g.getOutgoingEdges(v) works with a directed graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 29
+ Received  +  1

- Array [
-   DirectedEdge {
-     "_type": "DirectedEdge",

[Killed] BlockStatement
src/models/Graph/Graph.ts:225:31
      */
     getOutgoingEdges(vertex: V): E[] {
         return this.getListOfEdges().filter(({ vertexA, vertexB, isDirected }) => {
-            if (isDirected()) {
-                return vertexA.equals(vertex);
-            }
+            if (isDirected()) {}
 
             return vertexA.equals(vertex) || vertexB.equals(vertex);
killedBy: Test retrieving attached, incoming and outgoing edges for a vertex g.getOutgoingEdges(v) works with a directed graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 18

@@ -24,6 +24,24 @@
      },
      "vertexB": NamedVertex {

[Killed] ConditionalExpression
src/models/Graph/Graph.ts:225:17
      */
     getOutgoingEdges(vertex: V): E[] {
         return this.getListOfEdges().filter(({ vertexA, vertexB, isDirected }) => {
-            if (isDirected()) {
+            if (false) {
                 return vertexA.equals(vertex);
             }
killedBy: Test retrieving attached, incoming and outgoing edges for a vertex g.getOutgoingEdges(v) works with a directed graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 18

@@ -24,6 +24,24 @@
      },
      "vertexB": NamedVertex {

[Killed] ConditionalExpression
src/models/Graph/Graph.ts:229:20
                 return vertexA.equals(vertex);
             }
 
-            return vertexA.equals(vertex) || vertexB.equals(vertex);
+            return true;
         });
     }
killedBy: Test retrieving attached, incoming and outgoing edges for a vertex g.getOutgoingEdges(v) works with an undirected graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 36

@@ -1,9 +1,27 @@
  Array [
    UndirectedEdge {

[Killed] LogicalOperator
src/models/Graph/Graph.ts:229:20
                 return vertexA.equals(vertex);
             }
 
-            return vertexA.equals(vertex) || vertexB.equals(vertex);
+            return vertexA.equals(vertex) && vertexB.equals(vertex);
         });
     }
killedBy: Test retrieving attached, incoming and outgoing edges for a vertex g.getOutgoingEdges(v) works with an undirected graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 18
+ Received  +  0

@@ -6,24 +6,6 @@
      },
      "vertexB": NamedVertex {

[Killed] BlockStatement
src/models/Graph/Graph.ts:239:38
      *
      * @param vertex The vertex which attached edges should be found.
      */
-    getIncomingEdges(vertex: V): E[] {
-        return this.getListOfEdges().filter(({ vertexA, vertexB, isDirected }) => {
-            if (isDirected()) {
-                return vertexB.equals(vertex);
-            }
-
-            return vertexA.equals(vertex) || vertexB.equals(vertex);
-        });
-    }
+    getIncomingEdges(vertex: V): E[] {}
 
     /**
killedBy: Test retrieving attached, incoming and outgoing edges for a vertex g.getIncomingEdges(v) works with a directed graph
statusReason: TypeError: Cannot read properties of undefined (reading 'sort')

[Killed] BlockStatement
src/models/Graph/Graph.ts:240:83
      * @param vertex The vertex which attached edges should be found.
      */
     getIncomingEdges(vertex: V): E[] {
-        return this.getListOfEdges().filter(({ vertexA, vertexB, isDirected }) => {
-            if (isDirected()) {
-                return vertexB.equals(vertex);
-            }
-
-            return vertexA.equals(vertex) || vertexB.equals(vertex);
-        });
+        return this.getListOfEdges().filter(({ vertexA, vertexB, isDirected }) => {});
     }
 
killedBy: Test retrieving attached, incoming and outgoing edges for a vertex g.getIncomingEdges(v) works with a directed graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 29
+ Received  +  1

- Array [
-   DirectedEdge {
-     "_type": "DirectedEdge",

[Killed] ConditionalExpression
src/models/Graph/Graph.ts:241:17
      */
     getIncomingEdges(vertex: V): E[] {
         return this.getListOfEdges().filter(({ vertexA, vertexB, isDirected }) => {
-            if (isDirected()) {
+            if (true) {
                 return vertexB.equals(vertex);
             }
killedBy: Test retrieving attached, incoming and outgoing edges for a vertex g.getIncomingEdges(v) works with an undirected graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 18
+ Received  +  0

@@ -6,24 +6,6 @@
      },
      "vertexB": NamedVertex {

[Killed] ConditionalExpression
src/models/Graph/Graph.ts:245:20
                 return vertexB.equals(vertex);
             }
 
-            return vertexA.equals(vertex) || vertexB.equals(vertex);
+            return false;
         });
     }
killedBy: Test retrieving attached, incoming and outgoing edges for a vertex g.getIncomingEdges(v) works with an undirected graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 29
+ Received  +  1

- Array [
-   UndirectedEdge {
-     "_type": "UndirectedEdge",

[Killed] BlockStatement
src/models/Graph/Graph.ts:255:43
      * @param vertexA The source vertex.
      * @param vertexB The target vertex.
      */
-    getEdges(vertexA: V, vertexB: V): E[] {
-        return this.getListOfEdges().filter(
-            (maybeWantedEdge) =>
-                (maybeWantedEdge.vertexA.equals(vertexA) && maybeWantedEdge.vertexB.equals(vertexB)) ||
-                (!maybeWantedEdge.isDirected() &&
-                    maybeWantedEdge.vertexA.equals(vertexB) &&
-                    maybeWantedEdge.vertexB.equals(vertexA))
-        );
-    }
+    getEdges(vertexA: V, vertexB: V): E[] {}
 
     /**
killedBy: graph.deleteEdge(e) directed edges edge list is correct removes the edge a -> b and receives the correct edge count
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ArrowFunction
src/models/Graph/Graph.ts:257:13
      */
     getEdges(vertexA: V, vertexB: V): E[] {
         return this.getListOfEdges().filter(
-            (maybeWantedEdge) =>
-                (maybeWantedEdge.vertexA.equals(vertexA) && maybeWantedEdge.vertexB.equals(vertexB)) ||
-                (!maybeWantedEdge.isDirected() &&
-                    maybeWantedEdge.vertexA.equals(vertexB) &&
-                    maybeWantedEdge.vertexB.equals(vertexA))
+            () => undefined
         );
     }
killedBy: graph.deleteEdge(e) Reproduce #24 2x WeightedUndirectedEdges (not equal) delete 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/models/Graph/Graph.ts:258:17
     getEdges(vertexA: V, vertexB: V): E[] {
         return this.getListOfEdges().filter(
             (maybeWantedEdge) =>
-                (maybeWantedEdge.vertexA.equals(vertexA) && maybeWantedEdge.vertexB.equals(vertexB)) ||
-                (!maybeWantedEdge.isDirected() &&
-                    maybeWantedEdge.vertexA.equals(vertexB) &&
-                    maybeWantedEdge.vertexB.equals(vertexA))
+                true
         );
     }
killedBy: g.*dfsIterator() Normal Case Returns last taken edge correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -10,14 +10,14 @@
      },
    },

[Killed] ConditionalExpression
src/models/Graph/Graph.ts:258:18
     getEdges(vertexA: V, vertexB: V): E[] {
         return this.getListOfEdges().filter(
             (maybeWantedEdge) =>
-                (maybeWantedEdge.vertexA.equals(vertexA) && maybeWantedEdge.vertexB.equals(vertexB)) ||
+                (false) ||
                 (!maybeWantedEdge.isDirected() &&
                     maybeWantedEdge.vertexA.equals(vertexB) &&
killedBy: g.*dfsIterator() Normal Case Returns last taken edge correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 18
+ Received  +  2

  Array [
    null,
-   DirectedEdge {

[Killed] LogicalOperator
src/models/Graph/Graph.ts:259:18
         return this.getListOfEdges().filter(
             (maybeWantedEdge) =>
                 (maybeWantedEdge.vertexA.equals(vertexA) && maybeWantedEdge.vertexB.equals(vertexB)) ||
-                (!maybeWantedEdge.isDirected() &&
-                    maybeWantedEdge.vertexA.equals(vertexB) &&
+                (!maybeWantedEdge.isDirected() || maybeWantedEdge.vertexA.equals(vertexB) &&
                     maybeWantedEdge.vertexB.equals(vertexA))
         );
killedBy: graph.deleteEdge(e) undirected edges adjacencyList is correct removes the edge b <-> c and removes the entry of c in the list of b
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] BooleanLiteral
src/models/Graph/Graph.ts:259:18
         return this.getListOfEdges().filter(
             (maybeWantedEdge) =>
                 (maybeWantedEdge.vertexA.equals(vertexA) && maybeWantedEdge.vertexB.equals(vertexB)) ||
-                (!maybeWantedEdge.isDirected() &&
+                (maybeWantedEdge.isDirected() &&
                     maybeWantedEdge.vertexA.equals(vertexB) &&
                     maybeWantedEdge.vertexB.equals(vertexA))
killedBy: graph.deleteEdge(e) Reproduce #24 2x WeightedUndirectedEdges (not equal) delete 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BlockStatement
src/models/Graph/Graph.ts:271:17
      *
      * References to the edges remain in-tact. The adjacency matrix is regenerated out-dating all references to the matrix.
      */
-    transpose() {
-        this._listOfEdges.forEach((singleEdge) => {
-            singleEdge.transpose();
-        });
-
-        this._adjacencyMatrix = AdjacencyMatrix.fromEdgeList(this.getListOfEdges());
-    }
+    transpose() {}
 
     dfsForEach<T>(
killedBy: g.transpose() Normal Cases Edge list is correct after transposing
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    DirectedEdge {
      "_type": "DirectedEdge",

[Killed] BlockStatement
src/models/Graph/Graph.ts:272:51
      * References to the edges remain in-tact. The adjacency matrix is regenerated out-dating all references to the matrix.
      */
     transpose() {
-        this._listOfEdges.forEach((singleEdge) => {
-            singleEdge.transpose();
-        });
+        this._listOfEdges.forEach((singleEdge) => {});
 
         this._adjacencyMatrix = AdjacencyMatrix.fromEdgeList(this.getListOfEdges());
killedBy: g.transpose() Normal Cases Edge list is correct after transposing
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    DirectedEdge {
      "_type": "DirectedEdge",

[Survived] BlockStatement
src/models/Graph/Graph.ts:284:7
         initialPayload: T,
         startVertex?: V,
         orderFunction: (a: V, b: V, more?: GraphIterationCallbackParameter<V, E, this, T>) => number = vertexCompareTo
-    ) {
-        const payload: T = initialPayload;
-        for (const dfsIteration of this.dfsIterator(startVertex, orderFunction)) cb({ ...dfsIteration, payload });
-    }
+    ) {}
 
     *dfsIterator(

[Killed] BooleanLiteral
src/models/Graph/Graph.ts:294:102
         orderFunction: (a: V, b: V, more?: GraphIterationCallbackParameter<V, E, this, any>) => number = vertexCompareTo
     ): Generator<Omit<GraphIterationCallbackParameter<V, E, this, any>, 'payload'>, void, unknown> {
         const visited: MutableHashMap<V, boolean> = new MutableHashMap();
-        for (const singleVertexInGraph of this.getListOfVertices()) visited.set(singleVertexInGraph, false);
+        for (const singleVertexInGraph of this.getListOfVertices()) visited.set(singleVertexInGraph, true);
         let currentVertex: V | undefined;
 
killedBy: g.*dfsIterator() Normal Case Works for directed graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

- Array [
-   NamedVertex {
-     "name": "a",

[Killed] BlockStatement
src/models/Graph/Graph.ts:297:40
         for (const singleVertexInGraph of this.getListOfVertices()) visited.set(singleVertexInGraph, false);
         let currentVertex: V | undefined;
 
-        if (startVertex === undefined) {
-            const listOfNodes = this.getListOfVertices();
-            if (listOfNodes.length === 0) currentVertex = undefined;
-            else {
-                listOfNodes.sort(orderFunction);
-                currentVertex = listOfNodes[0];
-            }
-        } else {
+        if (startVertex === undefined) {} else {
             currentVertex = startVertex;
         }
killedBy: g.*dfsIterator() Normal Case Works for directed graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

- Array [
-   NamedVertex {
-     "name": "a",

[Killed] ConditionalExpression
src/models/Graph/Graph.ts:297:13
         for (const singleVertexInGraph of this.getListOfVertices()) visited.set(singleVertexInGraph, false);
         let currentVertex: V | undefined;
 
-        if (startVertex === undefined) {
+        if (false) {
             const listOfNodes = this.getListOfVertices();
             if (listOfNodes.length === 0) currentVertex = undefined;
killedBy: g.*dfsIterator() Normal Case Works for directed graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

- Array [
-   NamedVertex {
-     "name": "a",

[Killed] ConditionalExpression
src/models/Graph/Graph.ts:299:17
 
         if (startVertex === undefined) {
             const listOfNodes = this.getListOfVertices();
-            if (listOfNodes.length === 0) currentVertex = undefined;
+            if (true) currentVertex = undefined;
             else {
                 listOfNodes.sort(orderFunction);
killedBy: g.*dfsIterator() Normal Case Works for directed graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

- Array [
-   NamedVertex {
-     "name": "a",

[Killed] EqualityOperator
src/models/Graph/Graph.ts:299:17
 
         if (startVertex === undefined) {
             const listOfNodes = this.getListOfVertices();
-            if (listOfNodes.length === 0) currentVertex = undefined;
+            if (listOfNodes.length !== 0) currentVertex = undefined;
             else {
                 listOfNodes.sort(orderFunction);
killedBy: g.*dfsIterator() Normal Case Works for directed graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

- Array [
-   NamedVertex {
-     "name": "a",

[Killed] BlockStatement
src/models/Graph/Graph.ts:300:18
         if (startVertex === undefined) {
             const listOfNodes = this.getListOfVertices();
             if (listOfNodes.length === 0) currentVertex = undefined;
-            else {
-                listOfNodes.sort(orderFunction);
-                currentVertex = listOfNodes[0];
-            }
+            else {}
         } else {
             currentVertex = startVertex;
killedBy: g.*dfsIterator() Normal Case Works for directed graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

- Array [
-   NamedVertex {
-     "name": "a",

[NoCoverage] BlockStatement
src/models/Graph/Graph.ts:304:16
                 listOfNodes.sort(orderFunction);
                 currentVertex = listOfNodes[0];
             }
-        } else {
-            currentVertex = startVertex;
-        }
+        } else {}
 
         const stack: V[] = [];

[Killed] ConditionalExpression
src/models/Graph/Graph.ts:310:13
 
         const stack: V[] = [];
 
-        if (currentVertex !== undefined) {
+        if (false) {
             stack.push(currentVertex);
 
killedBy: g.*dfsIterator() Normal Case Works for directed graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

- Array [
-   NamedVertex {
-     "name": "a",

[Killed] EqualityOperator
src/models/Graph/Graph.ts:310:13
 
         const stack: V[] = [];
 
-        if (currentVertex !== undefined) {
+        if (currentVertex === undefined) {
             stack.push(currentVertex);
 
killedBy: g.*dfsIterator() Normal Case Works for directed graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

- Array [
-   NamedVertex {
-     "name": "a",

[Killed] BooleanLiteral
src/models/Graph/Graph.ts:316:20
             let takenEdge = null;
             let previousVertex = null;
 
-            while (![...visited.values()].every((x) => x)) {
+            while ([...visited.values()].every(x => x)) {
                 currentVertex = stack.pop();
                 if (currentVertex === undefined) {
killedBy: g.*dfsIterator() Normal Case Works for directed graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

- Array [
-   NamedVertex {
-     "name": "a",

[Killed] ConditionalExpression
src/models/Graph/Graph.ts:316:20
             let takenEdge = null;
             let previousVertex = null;
 
-            while (![...visited.values()].every((x) => x)) {
+            while (false) {
                 currentVertex = stack.pop();
                 if (currentVertex === undefined) {
killedBy: g.*dfsIterator() Normal Case Works for directed graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

- Array [
-   NamedVertex {
-     "name": "a",

[Killed] EqualityOperator
src/models/Graph/Graph.ts:318:21
 
             while (![...visited.values()].every((x) => x)) {
                 currentVertex = stack.pop();
-                if (currentVertex === undefined) {
+                if (currentVertex !== undefined) {
                     takenEdge = null;
                     previousVertex = null;
killedBy: g.*dfsIterator() Normal Case Works for directed graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 9
+ Received  + 0

  Array [
    NamedVertex {
      "name": "a",

[Killed] ConditionalExpression
src/models/Graph/Graph.ts:318:21
 
             while (![...visited.values()].every((x) => x)) {
                 currentVertex = stack.pop();
-                if (currentVertex === undefined) {
+                if (true) {
                     takenEdge = null;
                     previousVertex = null;
killedBy: g.*dfsIterator() Normal Case Works for directed graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -1,14 +1,14 @@
  Array [
    NamedVertex {

[Killed] BlockStatement
src/models/Graph/Graph.ts:322:59
                     takenEdge = null;
                     previousVertex = null;
                     for (const maybeUnvisited of this.getListOfVertices())
-                        if (!visited.get(maybeUnvisited)) {
-                            currentVertex = maybeUnvisited;
-                            break;
-                        }
+                        if (!visited.get(maybeUnvisited)) {}
                 } else {
                     if (previousVertex !== null) {
killedBy: g.*dfsIterator() Normal Case Works for directed graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 0

@@ -6,12 +6,6 @@
      "name": "c",
    },
