[Killed] ConditionalExpression
src/models/Graph/Graph.ts:322:29
                     takenEdge = null;
                     previousVertex = null;
                     for (const maybeUnvisited of this.getListOfVertices())
-                        if (!visited.get(maybeUnvisited)) {
+                        if (false) {
                             currentVertex = maybeUnvisited;
                             break;
killedBy: g.*dfsIterator() Normal Case Works for directed graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 0

@@ -6,12 +6,6 @@
      "name": "c",
    },

[Killed] BlockStatement
src/models/Graph/Graph.ts:326:24
                             currentVertex = maybeUnvisited;
                             break;
                         }
-                } else {
-                    if (previousVertex !== null) {
-                        const possibleEdges = this.getEdges(previousVertex, currentVertex);
-                        if (possibleEdges.length === 0) takenEdge = null;
-                        else takenEdge = possibleEdges[0];
-                    } else {
-                        takenEdge = null;
-                    }
-                }
+                } else {}
 
                 if (currentVertex === undefined) break;
killedBy: g.*dfsIterator() Normal Case Returns last taken edge correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 18
+ Received  +  2

  Array [
    null,
-   DirectedEdge {

[Killed] ConditionalExpression
src/models/Graph/Graph.ts:327:25
                             break;
                         }
                 } else {
-                    if (previousVertex !== null) {
+                    if (false) {
                         const possibleEdges = this.getEdges(previousVertex, currentVertex);
                         if (possibleEdges.length === 0) takenEdge = null;
killedBy: g.*dfsIterator() Normal Case Returns last taken edge correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 18
+ Received  +  2

  Array [
    null,
-   DirectedEdge {

[Killed] BlockStatement
src/models/Graph/Graph.ts:327:50
                             break;
                         }
                 } else {
-                    if (previousVertex !== null) {
-                        const possibleEdges = this.getEdges(previousVertex, currentVertex);
-                        if (possibleEdges.length === 0) takenEdge = null;
-                        else takenEdge = possibleEdges[0];
-                    } else {
+                    if (previousVertex !== null) {} else {
                         takenEdge = null;
                     }
killedBy: g.*dfsIterator() Normal Case Returns last taken edge correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 18
+ Received  +  2

  Array [
    null,
-   DirectedEdge {

[Killed] ConditionalExpression
src/models/Graph/Graph.ts:329:29
                 } else {
                     if (previousVertex !== null) {
                         const possibleEdges = this.getEdges(previousVertex, currentVertex);
-                        if (possibleEdges.length === 0) takenEdge = null;
+                        if (true) takenEdge = null;
                         else takenEdge = possibleEdges[0];
                     } else {
killedBy: g.*dfsIterator() Normal Case Returns last taken edge correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 18
+ Received  +  2

  Array [
    null,
-   DirectedEdge {

[Killed] EqualityOperator
src/models/Graph/Graph.ts:329:29
                 } else {
                     if (previousVertex !== null) {
                         const possibleEdges = this.getEdges(previousVertex, currentVertex);
-                        if (possibleEdges.length === 0) takenEdge = null;
+                        if (possibleEdges.length !== 0) takenEdge = null;
                         else takenEdge = possibleEdges[0];
                     } else {
killedBy: g.*dfsIterator() Normal Case Returns last taken edge correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 18
+ Received  +  2

  Array [
    null,
-   DirectedEdge {

[Survived] BlockStatement
src/models/Graph/Graph.ts:331:28
                         const possibleEdges = this.getEdges(previousVertex, currentVertex);
                         if (possibleEdges.length === 0) takenEdge = null;
                         else takenEdge = possibleEdges[0];
-                    } else {
-                        takenEdge = null;
-                    }
+                    } else {}
                 }
 

[Killed] ConditionalExpression
src/models/Graph/Graph.ts:336:21
                     }
                 }
 
-                if (currentVertex === undefined) break;
+                if (true) break;
 
                 if (!visited.get(currentVertex)) {
killedBy: g.*dfsIterator() Normal Case Works for directed graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

- Array [
-   NamedVertex {
-     "name": "a",

[Killed] EqualityOperator
src/models/Graph/Graph.ts:336:21
                     }
                 }
 
-                if (currentVertex === undefined) break;
+                if (currentVertex !== undefined) break;
 
                 if (!visited.get(currentVertex)) {
killedBy: g.*dfsIterator() Normal Case Works for directed graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

- Array [
-   NamedVertex {
-     "name": "a",

[Timeout] BooleanLiteral
src/models/Graph/Graph.ts:338:21
 
                 if (currentVertex === undefined) break;
 
-                if (!visited.get(currentVertex)) {
+                if (visited.get(currentVertex)) {
                     visited.set(currentVertex, true);
                     const adjacentVertices = this.getChildVertices(currentVertex);

[Timeout] ConditionalExpression
src/models/Graph/Graph.ts:338:21
 
                 if (currentVertex === undefined) break;
 
-                if (!visited.get(currentVertex)) {
+                if (false) {
                     visited.set(currentVertex, true);
                     const adjacentVertices = this.getChildVertices(currentVertex);

[Timeout] BooleanLiteral
src/models/Graph/Graph.ts:339:48
                 if (currentVertex === undefined) break;
 
                 if (!visited.get(currentVertex)) {
-                    visited.set(currentVertex, true);
+                    visited.set(currentVertex, false);
                     const adjacentVertices = this.getChildVertices(currentVertex);
                     adjacentVertices.sort(orderFunction);

[Killed] BlockStatement
src/models/Graph/Graph.ts:362:45
      * @throws VertexNotFoundError if at least on of the passed vertices is not actually contained in the Graph per its equals
      * method.
      */
-    getSubgraph(vertices: V[]): Graph<V, E> {
-        vertices.forEach((singleVertex) => this.validateVertexIsContainedInGraph(singleVertex));
-
-        const subgraph = new Graph<V, E>();
-        subgraph.addVertex(...vertices);
-
-        this.getListOfEdges().forEach((singleEdge) => {
-            if (
-                subgraph.isVertexContainedInGraph(singleEdge.vertexA) &&
-                subgraph.isVertexContainedInGraph(singleEdge.vertexB)
-            )
-                subgraph.addEdge(singleEdge);
-        });
-
-        return subgraph;
-    }
+    getSubgraph(vertices: V[]): Graph<V, E> {}
 
     getStronglyConnectedComponents(): V[][] {
killedBy: g.getSubgraph(vs) Normal Cases All passed vertices are contained
statusReason: TypeError: Cannot read properties of undefined (reading 'getListOfVertices')

[Survived] ArrowFunction
src/models/Graph/Graph.ts:363:26
      * method.
      */
     getSubgraph(vertices: V[]): Graph<V, E> {
-        vertices.forEach((singleVertex) => this.validateVertexIsContainedInGraph(singleVertex));
+        vertices.forEach(() => undefined);
 
         const subgraph = new Graph<V, E>();

[Killed] BlockStatement
src/models/Graph/Graph.ts:368:55
         const subgraph = new Graph<V, E>();
         subgraph.addVertex(...vertices);
 
-        this.getListOfEdges().forEach((singleEdge) => {
-            if (
-                subgraph.isVertexContainedInGraph(singleEdge.vertexA) &&
-                subgraph.isVertexContainedInGraph(singleEdge.vertexB)
-            )
-                subgraph.addEdge(singleEdge);
-        });
+        this.getListOfEdges().forEach((singleEdge) => {});
 
         return subgraph;
killedBy: g.getSubgraph(vs) Normal Cases Edges which had both vertices passed are contained
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 47
+ Received  +  1

- Array [
-   DirectedEdge {
-     "_type": "DirectedEdge",

[Killed] ConditionalExpression
src/models/Graph/Graph.ts:370:17
 
         this.getListOfEdges().forEach((singleEdge) => {
             if (
-                subgraph.isVertexContainedInGraph(singleEdge.vertexA) &&
-                subgraph.isVertexContainedInGraph(singleEdge.vertexB)
+                true
             )
                 subgraph.addEdge(singleEdge);
killedBy: g.getSubgraph(vs) Normal Cases All passed vertices are contained
statusReason: Error: Vertex {"name":"c"} not found in graph.

[Killed] LogicalOperator
src/models/Graph/Graph.ts:370:17
 
         this.getListOfEdges().forEach((singleEdge) => {
             if (
-                subgraph.isVertexContainedInGraph(singleEdge.vertexA) &&
-                subgraph.isVertexContainedInGraph(singleEdge.vertexB)
+                subgraph.isVertexContainedInGraph(singleEdge.vertexA) || subgraph.isVertexContainedInGraph(singleEdge.vertexB)
             )
                 subgraph.addEdge(singleEdge);
killedBy: g.getSubgraph(vs) Normal Cases All passed vertices are contained
statusReason: Error: Vertex {"name":"c"} not found in graph.

[Killed] BlockStatement
src/models/Graph/Graph.ts:379:45
         return subgraph;
     }
 
-    getStronglyConnectedComponents(): V[][] {
-        return TarjanStronglyConnectedComponentsAlgorithm.getStronglyConnectedComponentFor(this);
-    }
+    getStronglyConnectedComponents(): V[][] {}
 
     /**
killedBy: g.getStronglyConnectedComponent() Normal Cases Works with directed edges
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [[{"name": "c"}, {"name": "b"}, {"name": "a"}], [{"name": "d"}], [{"name": "e"}]]
Received: undefined

[Killed] BlockStatement
src/models/Graph/Graph.ts:386:18
     /**
      * Returns a deep clone of the Graph. Including edges and vertices.
      */
-    copy(): this {
-        return cloneDeep(this);
-    }
+    copy(): this {}
 
     /**
killedBy: g.transpose() Normal Cases Graph equals itself afer transposing twice
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: undefined

[Killed] BlockStatement
src/models/Graph/Graph.ts:393:27
     /**
      * Retrieves a deep clone of the list of edges used to represent this graph internally.
      */
-    getListOfEdges(): E[] {
-        return cloneDeep(this._listOfEdges);
-    }
+    getListOfEdges(): E[] {}
 
     /**
killedBy: g.addEdge() Normal Cases Adding an edge adds it to the edge list as well
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"_type": "DirectedEdge", "vertexA": {"name": "a"}, "vertexB": {"name": "b"}}]
Received: undefined

[Killed] BlockStatement
src/models/Graph/Graph.ts:400:30
     /**
      * Retrieves a deep clone of the list of vertices used to represent this graph internally.
      */
-    getListOfVertices(): V[] {
-        return cloneDeep(this._listOfVertices);
-    }
+    getListOfVertices(): V[] {}
 
     /**
killedBy: g.getStronglyConnectedComponent() Normal Cases Works with directed edges
statusReason: TypeError: Cannot read properties of undefined (reading 'forEach')

[Killed] BlockStatement
src/models/Graph/Graph.ts:407:46
     /**
      * Retrieves a deep clone of the adjacency matrix used to represent this graph internally.
      */
-    getAdjacencyMatrix(): AdjacencyMatrix<V> {
-        return cloneDeep(this._adjacencyMatrix);
-    }
+    getAdjacencyMatrix(): AdjacencyMatrix<V> {}
 
     /**
killedBy: g.getChildNodes(v) Normal Cases Graph has more edges than vertices Works correctly with a directed Graph
statusReason: TypeError: Cannot read properties of undefined (reading 'get')

[Killed] BlockStatement
src/models/Graph/Graph.ts:414:42
     /**
      * Retrieves deep clone of the adjacency list used to represent this graph internally.
      */
-    getAdjacencyList(): AdjacencyList<V> {
-        return cloneDeep(this._adjacencyList);
-    }
+    getAdjacencyList(): AdjacencyList<V> {}
 
     /**
killedBy: g.addEdge() Normal Cases Adding a directed Edge update the adjacency list accordingly
statusReason: TypeError: Cannot read properties of undefined (reading 'getAdjacentVertices')

[Killed] BlockStatement
src/models/Graph/Graph.ts:424:46
      * If true it will add unknown vertices.
      * If false it will throw an VertexNotFoundError when trying to add edges with unknown vertices.
      */
-    get addUnknownVerticesInEdges(): boolean {
-        return this._addUnknownVerticesInEdges;
-    }
+    get addUnknownVerticesInEdges(): boolean {}
 
     /**
killedBy: g.getChildNodes(v) Normal Cases Graph has fewer vertices than edges Works correctly with a directed Graph
statusReason: Error: Vertex {"name":"a"} not found in graph.

[Survived] BlockStatement
src/models/Graph/Graph.ts:435:54
      *
      * @throws VertexNotFoundError if any vertex of the edge does not exist in the Graph.
      */
-    validateEdgeVerticesAreContainedInGraph(edge: E) {
-        this.validateVertexIsContainedInGraph(edge.vertexA);
-        this.validateVertexIsContainedInGraph(edge.vertexB);
-    }
+    validateEdgeVerticesAreContainedInGraph(edge: E) {}
 
     /**

[Killed] ConditionalExpression
src/models/Graph/Graph.ts:448:13
      * @throws VertexNotFoundError if the vertex does not exist in the Graph.
      */
     validateVertexIsContainedInGraph(vertex: V) {
-        if (!this.isVertexContainedInGraph(vertex)) throw new VertexNotFoundError(vertex);
+        if (true) throw new VertexNotFoundError(vertex);
     }
 
killedBy: graph.deleteEdge(e) directed edges graph is initially as expected
statusReason: Error: Vertex {"name":"a"} not found in graph.

[Killed] BlockStatement
src/models/Graph/Graph.ts:459:50
      *
      * @param vertex The vertex which should be checked to be contained in the Graph.
      */
-    isVertexContainedInGraph(vertex: V): boolean {
-        return this._listOfVertices.find((singleVertex) => singleVertex.equals(vertex)) !== undefined;
-    }
+    isVertexContainedInGraph(vertex: V): boolean {}
 }
 
killedBy: graph.deleteVertex(v) graph is initially as expected
statusReason: Error: Vertex {"name":"a"} not found in graph.

[Killed] ConditionalExpression
src/models/Graph/Graph.ts:460:16
      * @param vertex The vertex which should be checked to be contained in the Graph.
      */
     isVertexContainedInGraph(vertex: V): boolean {
-        return this._listOfVertices.find((singleVertex) => singleVertex.equals(vertex)) !== undefined;
+        return false;
     }
 }
killedBy: Test retrieving attached, incoming and outgoing edges for a vertex g.getAttachedEdges(v) works with a directed graph
statusReason: Error: Vertex {"name":"c"} not found in graph.

[Killed] ArrowFunction
src/models/Graph/Graph.ts:460:42
      * @param vertex The vertex which should be checked to be contained in the Graph.
      */
     isVertexContainedInGraph(vertex: V): boolean {
-        return this._listOfVertices.find((singleVertex) => singleVertex.equals(vertex)) !== undefined;
+        return this._listOfVertices.find(() => undefined) !== undefined;
     }
 }
killedBy: g.getSubgraph(vs) Normal Cases All passed vertices are contained
statusReason: Error: Vertex {"name":"a"} not found in graph.
