[Killed] BlockStatement
models/Graph/algorithms/TarjanStronglyConnectedComponentsAlgorithm.ts:6:47
 import { MutableHashMap } from '@tgillespie/hash-data-structures';
 
 export class TarjanStronglyConnectedComponentsAlgorithm<V extends Vertex> {
-    private constructor(graph: Graph<V, any>) {
-        this.graph = graph;
-
-        this.discreteTime = 0;
-        this.stack = [];
-        this.lowMap = new MutableHashMap();
-        this.discMap = new MutableHashMap();
-
-        this.result = [];
-    }
+    private constructor(graph: Graph<V, any>) {}
 
     graph: Graph<V, any>;
killedBy: g.getStronglyConnectedComponent() Normal Cases Works with directed edges
statusReason: TypeError: Cannot read properties of undefined (reading 'getListOfVertices')

[Killed] BlockStatement
models/Graph/algorithms/TarjanStronglyConnectedComponentsAlgorithm.ts:26:92
 
     result: V[][];
 
-    static getStronglyConnectedComponentFor<V extends Vertex>(graph: Graph<V, any>): V[][] {
-        const algo = new TarjanStronglyConnectedComponentsAlgorithm(graph);
-
-        algo.graph.getListOfVertices().forEach((singleVertex) => {
-            if (!algo.discMap.has(singleVertex)) algo.dfsUtil(singleVertex);
-        });
-
-        return algo.result;
-    }
+    static getStronglyConnectedComponentFor<V extends Vertex>(graph: Graph<V, any>): V[][] {}
 
     private dfsUtil(currentVertex: V) {
killedBy: g.getStronglyConnectedComponent() Normal Cases Works with directed edges
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [[{"name": "c"}, {"name": "b"}, {"name": "a"}], [{"name": "d"}], [{"name": "e"}]]
Received: undefined

[Killed] BlockStatement
models/Graph/algorithms/TarjanStronglyConnectedComponentsAlgorithm.ts:29:66
     static getStronglyConnectedComponentFor<V extends Vertex>(graph: Graph<V, any>): V[][] {
         const algo = new TarjanStronglyConnectedComponentsAlgorithm(graph);
 
-        algo.graph.getListOfVertices().forEach((singleVertex) => {
-            if (!algo.discMap.has(singleVertex)) algo.dfsUtil(singleVertex);
-        });
+        algo.graph.getListOfVertices().forEach((singleVertex) => {});
 
         return algo.result;
killedBy: g.getStronglyConnectedComponent() Normal Cases Works with directed edges
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

- Array [
-   Array [
-     NamedVertex {

[Killed] ConditionalExpression
models/Graph/algorithms/TarjanStronglyConnectedComponentsAlgorithm.ts:30:17
         const algo = new TarjanStronglyConnectedComponentsAlgorithm(graph);
 
         algo.graph.getListOfVertices().forEach((singleVertex) => {
-            if (!algo.discMap.has(singleVertex)) algo.dfsUtil(singleVertex);
+            if (false) algo.dfsUtil(singleVertex);
         });
 
killedBy: g.getStronglyConnectedComponent() Normal Cases Works with directed edges
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

- Array [
-   Array [
-     NamedVertex {

[Killed] ConditionalExpression
models/Graph/algorithms/TarjanStronglyConnectedComponentsAlgorithm.ts:30:17
         const algo = new TarjanStronglyConnectedComponentsAlgorithm(graph);
 
         algo.graph.getListOfVertices().forEach((singleVertex) => {
-            if (!algo.discMap.has(singleVertex)) algo.dfsUtil(singleVertex);
+            if (true) algo.dfsUtil(singleVertex);
         });
 
killedBy: g.getStronglyConnectedComponent() Normal Cases Works with directed edges
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 10

@@ -10,10 +10,20 @@
        "name": "a",
      },

[Killed] AssignmentOperator
models/Graph/algorithms/TarjanStronglyConnectedComponentsAlgorithm.ts:39:9
     private dfsUtil(currentVertex: V) {
         this.discMap.set(currentVertex, this.discreteTime);
         this.lowMap.set(currentVertex, this.discreteTime);
-        this.discreteTime += 1;
+        this.discreteTime -= 1;
         this.stack.push(currentVertex);
         this.graph.getChildVertices(currentVertex).forEach((childVertex) => {
killedBy: g.getStronglyConnectedComponent() Normal Cases Works with directed edges
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 0

@@ -1,16 +1,10 @@
  Array [
    Array [

[Killed] BlockStatement
models/Graph/algorithms/TarjanStronglyConnectedComponentsAlgorithm.ts:41:77
         this.lowMap.set(currentVertex, this.discreteTime);
         this.discreteTime += 1;
         this.stack.push(currentVertex);
-        this.graph.getChildVertices(currentVertex).forEach((childVertex) => {
-            if (!this.discMap.has(childVertex)) {
-                this.dfsUtil(childVertex);
-                this.lowMap.set(
-                    currentVertex,
-                    Math.min(this.lowMap.get(currentVertex) ?? -1, this.lowMap.get(childVertex) ?? -1)
-                );
-            } else if (this.stack.find((stackVertex) => stackVertex.equals(childVertex)) !== undefined) {
-                this.lowMap.set(
-                    currentVertex,
-                    Math.min(this.lowMap.get(currentVertex) ?? -1, this.discMap.get(childVertex) ?? -1)
-                );
-            }
-        });
+        this.graph.getChildVertices(currentVertex).forEach((childVertex) => {});
 
         if (this.lowMap.get(currentVertex) === this.discMap.get(currentVertex)) {
killedBy: g.getStronglyConnectedComponent() Normal Cases Works with directed edges
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 6

@@ -1,15 +1,19 @@
  Array [
    Array [

[Killed] BooleanLiteral
models/Graph/algorithms/TarjanStronglyConnectedComponentsAlgorithm.ts:42:17
         this.discreteTime += 1;
         this.stack.push(currentVertex);
         this.graph.getChildVertices(currentVertex).forEach((childVertex) => {
-            if (!this.discMap.has(childVertex)) {
+            if (this.discMap.has(childVertex)) {
                 this.dfsUtil(childVertex);
                 this.lowMap.set(
killedBy: g.getStronglyConnectedComponent() Normal Cases Works with directed edges
statusReason: RangeError: Maximum call stack size exceeded

[Killed] BlockStatement
models/Graph/algorithms/TarjanStronglyConnectedComponentsAlgorithm.ts:42:49
         this.discreteTime += 1;
         this.stack.push(currentVertex);
         this.graph.getChildVertices(currentVertex).forEach((childVertex) => {
-            if (!this.discMap.has(childVertex)) {
-                this.dfsUtil(childVertex);
-                this.lowMap.set(
-                    currentVertex,
-                    Math.min(this.lowMap.get(currentVertex) ?? -1, this.lowMap.get(childVertex) ?? -1)
-                );
-            } else if (this.stack.find((stackVertex) => stackVertex.equals(childVertex)) !== undefined) {
+            if (!this.discMap.has(childVertex)) {} else if (this.stack.find((stackVertex) => stackVertex.equals(childVertex)) !== undefined) {
                 this.lowMap.set(
                     currentVertex,
killedBy: g.getStronglyConnectedComponent() Normal Cases Works with directed edges
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 6

@@ -1,15 +1,19 @@
  Array [
    Array [

[Killed] LogicalOperator
models/Graph/algorithms/TarjanStronglyConnectedComponentsAlgorithm.ts:46:68
                 this.dfsUtil(childVertex);
                 this.lowMap.set(
                     currentVertex,
-                    Math.min(this.lowMap.get(currentVertex) ?? -1, this.lowMap.get(childVertex) ?? -1)
+                    Math.min(this.lowMap.get(currentVertex) ?? -1, this.lowMap.get(childVertex) && -1)
                 );
             } else if (this.stack.find((stackVertex) => stackVertex.equals(childVertex)) !== undefined) {
killedBy: g.getStronglyConnectedComponent() Normal Cases Works with undirected edges
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 24
+ Received  +  1

- Array [
-   Array [
-     NamedVertex {

[Killed] LogicalOperator
models/Graph/algorithms/TarjanStronglyConnectedComponentsAlgorithm.ts:46:30
                 this.dfsUtil(childVertex);
                 this.lowMap.set(
                     currentVertex,
-                    Math.min(this.lowMap.get(currentVertex) ?? -1, this.lowMap.get(childVertex) ?? -1)
+                    Math.min(this.lowMap.get(currentVertex) && -1, this.lowMap.get(childVertex) ?? -1)
                 );
             } else if (this.stack.find((stackVertex) => stackVertex.equals(childVertex)) !== undefined) {
killedBy: g.getStronglyConnectedComponent() Normal Cases Works with directed edges
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

- Array [
-   Array [
-     NamedVertex {

[Killed] EqualityOperator
models/Graph/algorithms/TarjanStronglyConnectedComponentsAlgorithm.ts:48:24
                     currentVertex,
                     Math.min(this.lowMap.get(currentVertex) ?? -1, this.lowMap.get(childVertex) ?? -1)
                 );
-            } else if (this.stack.find((stackVertex) => stackVertex.equals(childVertex)) !== undefined) {
+            } else if (this.stack.find(stackVertex => stackVertex.equals(childVertex)) === undefined) {
                 this.lowMap.set(
                     currentVertex,
killedBy: g.getStronglyConnectedComponent() Normal Cases Works with directed edges
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 3

@@ -1,20 +1,19 @@
  Array [
    Array [

[Killed] ConditionalExpression
models/Graph/algorithms/TarjanStronglyConnectedComponentsAlgorithm.ts:48:24
                     currentVertex,
                     Math.min(this.lowMap.get(currentVertex) ?? -1, this.lowMap.get(childVertex) ?? -1)
                 );
-            } else if (this.stack.find((stackVertex) => stackVertex.equals(childVertex)) !== undefined) {
+            } else if (false) {
                 this.lowMap.set(
                     currentVertex,
killedBy: g.getStronglyConnectedComponent() Normal Cases Works with directed edges
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 4

@@ -1,13 +1,17 @@
  Array [
    Array [

[Killed] LogicalOperator
models/Graph/algorithms/TarjanStronglyConnectedComponentsAlgorithm.ts:51:30
             } else if (this.stack.find((stackVertex) => stackVertex.equals(childVertex)) !== undefined) {
                 this.lowMap.set(
                     currentVertex,
-                    Math.min(this.lowMap.get(currentVertex) ?? -1, this.discMap.get(childVertex) ?? -1)
+                    Math.min(this.lowMap.get(currentVertex) && -1, this.discMap.get(childVertex) ?? -1)
                 );
             }
killedBy: g.getStronglyConnectedComponent() Normal Cases Works with directed edges
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

- Array [
-   Array [
-     NamedVertex {

[Killed] LogicalOperator
models/Graph/algorithms/TarjanStronglyConnectedComponentsAlgorithm.ts:51:68
             } else if (this.stack.find((stackVertex) => stackVertex.equals(childVertex)) !== undefined) {
                 this.lowMap.set(
                     currentVertex,
-                    Math.min(this.lowMap.get(currentVertex) ?? -1, this.discMap.get(childVertex) ?? -1)
+                    Math.min(this.lowMap.get(currentVertex) ?? -1, this.discMap.get(childVertex) && -1)
                 );
             }
killedBy: g.getStronglyConnectedComponent() Normal Cases Works with undirected edges
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 24
+ Received  +  1

- Array [
-   Array [
-     NamedVertex {

[Killed] ConditionalExpression
models/Graph/algorithms/TarjanStronglyConnectedComponentsAlgorithm.ts:56:13
             }
         });
 
-        if (this.lowMap.get(currentVertex) === this.discMap.get(currentVertex)) {
+        if (false) {
             const currentComponent: V[] = [];
             let otherVertex: V;
killedBy: g.getStronglyConnectedComponent() Normal Cases Works with directed edges
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

- Array [
-   Array [
-     NamedVertex {

[Killed] BlockStatement
models/Graph/algorithms/TarjanStronglyConnectedComponentsAlgorithm.ts:56:81
             }
         });
 
-        if (this.lowMap.get(currentVertex) === this.discMap.get(currentVertex)) {
-            const currentComponent: V[] = [];
-            let otherVertex: V;
-            do {
-                otherVertex = this.stack.pop()!;
-                currentComponent.push(otherVertex);
-            } while (!currentVertex.equals(otherVertex));
-            this.result.push(currentComponent);
-        }
+        if (this.lowMap.get(currentVertex) === this.discMap.get(currentVertex)) {}
     }
 }
killedBy: g.getStronglyConnectedComponent() Normal Cases Works with directed edges
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

- Array [
-   Array [
-     NamedVertex {

[Timeout] BlockStatement
models/Graph/algorithms/TarjanStronglyConnectedComponentsAlgorithm.ts:59:16
         if (this.lowMap.get(currentVertex) === this.discMap.get(currentVertex)) {
             const currentComponent: V[] = [];
             let otherVertex: V;
-            do {
-                otherVertex = this.stack.pop()!;
-                currentComponent.push(otherVertex);
-            } while (!currentVertex.equals(otherVertex));
+            do {} while (!currentVertex.equals(otherVertex));
             this.result.push(currentComponent);
         }

[Killed] ConditionalExpression
models/Graph/algorithms/TarjanStronglyConnectedComponentsAlgorithm.ts:62:22
             do {
                 otherVertex = this.stack.pop()!;
                 currentComponent.push(otherVertex);
-            } while (!currentVertex.equals(otherVertex));
+            } while (false);
             this.result.push(currentComponent);
         }
killedBy: g.getStronglyConnectedComponent() Normal Cases Works with directed edges
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 16
+ Received  +  0

  Array [
    Array [
      NamedVertex {

[Killed] BooleanLiteral
models/Graph/algorithms/TarjanStronglyConnectedComponentsAlgorithm.ts:62:22
             do {
                 otherVertex = this.stack.pop()!;
                 currentComponent.push(otherVertex);
-            } while (!currentVertex.equals(otherVertex));
+            } while (currentVertex.equals(otherVertex));
             this.result.push(currentComponent);
         }
killedBy: g.getStronglyConnectedComponent() Normal Cases Works with directed edges
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 16
+ Received  +  0

  Array [
    Array [
      NamedVertex {
