[Survived] StringLiteral
JavaScriptGraph/src/Errors/VertexNotFoundError.ts:5:15
 
 export class VertexNotFoundError extends Error {
     constructor(vertex: Vertex) {
-        super(`Vertex ${JSON.stringify(vertex)} not found in graph.`);
+        super(``);
     }
 }
