[Killed] BlockStatement
models/Edge/EdgeContracts/Edge.ts:7:23
 export abstract class Edge<V extends Vertex> implements Hashable {
     constructor(public vertexA: V, public vertexB: V) {}
 
-    transpose(): void {
-        const temp = this.vertexA;
-        this.vertexA = this.vertexB;
-        this.vertexB = temp;
-    }
+    transpose(): void {}
 
     compareTo(other: this): number {
killedBy: g.transpose() Normal Cases Edge list is correct after transposing
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    DirectedEdge {
      "_type": "DirectedEdge",

[Killed] BlockStatement
models/Edge/EdgeContracts/Edge.ts:13:36
         this.vertexB = temp;
     }
 
-    compareTo(other: this): number {
-        const aCompare = this.vertexA.compareTo(other.vertexA);
-        if (aCompare !== 0) return aCompare;
-
-        return this.vertexB.compareTo(other.vertexB);
-    }
+    compareTo(other: this): number {}
 
     abstract isDirected(): boolean;
killedBy: g.getSubgraph(vs) Normal Cases Edges which had both vertices passed are contained
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

@@ -18,30 +18,30 @@
      },
    },

[Killed] EqualityOperator
models/Edge/EdgeContracts/Edge.ts:15:13
 
     compareTo(other: this): number {
         const aCompare = this.vertexA.compareTo(other.vertexA);
-        if (aCompare !== 0) return aCompare;
+        if (aCompare === 0) return aCompare;
 
         return this.vertexB.compareTo(other.vertexB);
killedBy: g.getSubgraph(vs) Normal Cases Edges which had both vertices passed are contained
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 8

  Array [
    DirectedEdge {
      "_type": "DirectedEdge",

[Killed] ConditionalExpression
models/Edge/EdgeContracts/Edge.ts:15:13
 
     compareTo(other: this): number {
         const aCompare = this.vertexA.compareTo(other.vertexA);
-        if (aCompare !== 0) return aCompare;
+        if (true) return aCompare;
 
         return this.vertexB.compareTo(other.vertexB);
killedBy: g.getSubgraph(vs) Normal Cases Edges which had both vertices passed are contained
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -30,18 +30,18 @@
      "_type": "DirectedEdge",
      "vertexA": NamedVertex {

[Killed] ArrowFunction
models/Edge/EdgeContracts/Edge.ts:26:26
     abstract hashCode(): number;
 }
 
-export const edgeEqual = <V extends Vertex, E extends Edge<V>>(a: E, b: E): boolean => a.equals(b as Hashable);
+export const edgeEqual = () => undefined;
 
 export const edgeCompareTo = <V extends Vertex, E extends Edge<V>>(a: E, b: E): number => a.compareTo(b);
killedBy: graph.deleteEdge(e) directed edges adjacencyMatrix is correct removes the edge a -> b and does not change the other edges to false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] ArrowFunction
models/Edge/EdgeContracts/Edge.ts:28:30
 
 export const edgeEqual = <V extends Vertex, E extends Edge<V>>(a: E, b: E): boolean => a.equals(b as Hashable);
 
-export const edgeCompareTo = <V extends Vertex, E extends Edge<V>>(a: E, b: E): number => a.compareTo(b);
+export const edgeCompareTo = () => undefined;
 
