[Killed] BlockStatement
models/Edge/UndirectedEdge/UndirectedEdge.ts:8:27
 export class UndirectedEdge<V extends Vertex> extends Edge<V> {
     protected _type: string = 'UndirectedEdge';
 
-    isDirected(): boolean {
-        return false;
-    }
+    isDirected(): boolean {}
 
     equals(other: Hashable): boolean {
killedBy: UndirectedEdge states that it is undirected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] BooleanLiteral
models/Edge/UndirectedEdge/UndirectedEdge.ts:9:16
     protected _type: string = 'UndirectedEdge';
 
     isDirected(): boolean {
-        return false;
+        return true;
     }
 
killedBy: UndirectedEdge states that it is undirected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
models/Edge/UndirectedEdge/UndirectedEdge.ts:12:38
         return false;
     }
 
-    equals(other: Hashable): boolean {
-        if (!(other instanceof UndirectedEdge)) return false;
-        if (this._type !== other._type) return false;
-
-        return this.isEqualUndirectedEdge(other);
-    }
+    equals(other: Hashable): boolean {}
 
     protected isEqualUndirectedEdge(other: UndirectedEdge<V>): boolean {
killedBy: graph.deleteEdge(e) undirected edges edge list is correct removes the edge a <-> b and receives the correct edge count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] BooleanLiteral
models/Edge/UndirectedEdge/UndirectedEdge.ts:13:13
     }
 
     equals(other: Hashable): boolean {
-        if (!(other instanceof UndirectedEdge)) return false;
+        if (other instanceof UndirectedEdge) return false;
         if (this._type !== other._type) return false;
 
killedBy: graph.deleteEdge(e) undirected edges edge list is correct removes the edge a <-> b and receives the correct edge count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] BooleanLiteral
models/Edge/UndirectedEdge/UndirectedEdge.ts:13:56
     }
 
     equals(other: Hashable): boolean {
-        if (!(other instanceof UndirectedEdge)) return false;
+        if (!(other instanceof UndirectedEdge)) return true;
         if (this._type !== other._type) return false;
 
killedBy: UndirectedEdge equals() return false for DirectedEdge
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] ConditionalExpression
models/Edge/UndirectedEdge/UndirectedEdge.ts:14:13
 
     equals(other: Hashable): boolean {
         if (!(other instanceof UndirectedEdge)) return false;
-        if (this._type !== other._type) return false;
+        if (false) return false;
 
         return this.isEqualUndirectedEdge(other);
killedBy: WeightedUndirectedEdge equals() returns false for a undirected edge (symmetric)
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] BooleanLiteral
models/Edge/UndirectedEdge/UndirectedEdge.ts:14:48
 
     equals(other: Hashable): boolean {
         if (!(other instanceof UndirectedEdge)) return false;
-        if (this._type !== other._type) return false;
+        if (this._type !== other._type) return true;
 
         return this.isEqualUndirectedEdge(other);
killedBy: UndirectedEdge equals() return false when messing with the _type
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] BlockStatement
models/Edge/UndirectedEdge/UndirectedEdge.ts:19:72
         return this.isEqualUndirectedEdge(other);
     }
 
-    protected isEqualUndirectedEdge(other: UndirectedEdge<V>): boolean {
-        if (this.isDirected() !== other.isDirected()) return false;
-
-        return (
-            (this.vertexA.equals(other.vertexA) && this.vertexB.equals(other.vertexB)) ||
-            (this.vertexA.equals(other.vertexB) && this.vertexB.equals(other.vertexA))
-        );
-    }
+    protected isEqualUndirectedEdge(other: UndirectedEdge<V>): boolean {}
 
     hashCode(): number {
killedBy: graph.deleteEdge(e) undirected edges edge list is correct removes the edge a <-> b and receives the correct edge count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] EqualityOperator
models/Edge/UndirectedEdge/UndirectedEdge.ts:20:13
     }
 
     protected isEqualUndirectedEdge(other: UndirectedEdge<V>): boolean {
-        if (this.isDirected() !== other.isDirected()) return false;
+        if (this.isDirected() === other.isDirected()) return false;
 
         return (
killedBy: graph.deleteEdge(e) undirected edges edge list is correct removes the edge a <-> b and receives the correct edge count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] BooleanLiteral
models/Edge/UndirectedEdge/UndirectedEdge.ts:20:62
     }
 
     protected isEqualUndirectedEdge(other: UndirectedEdge<V>): boolean {
-        if (this.isDirected() !== other.isDirected()) return false;
+        if (this.isDirected() !== other.isDirected()) return true;
 
         return (
killedBy: UndirectedEdge equals() return false when messing with the isDirected return value
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] ConditionalExpression
models/Edge/UndirectedEdge/UndirectedEdge.ts:23:14
         if (this.isDirected() !== other.isDirected()) return false;
 
         return (
-            (this.vertexA.equals(other.vertexA) && this.vertexB.equals(other.vertexB)) ||
+            (false) ||
             (this.vertexA.equals(other.vertexB) && this.vertexB.equals(other.vertexA))
         );
killedBy: graph.deleteEdge(e) undirected edges edge list is correct removes the edge a <-> b and receives the correct edge count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] LogicalOperator
models/Edge/UndirectedEdge/UndirectedEdge.ts:23:14
         if (this.isDirected() !== other.isDirected()) return false;
 
         return (
-            (this.vertexA.equals(other.vertexA) && this.vertexB.equals(other.vertexB)) ||
+            (this.vertexA.equals(other.vertexA) || this.vertexB.equals(other.vertexB)) ||
             (this.vertexA.equals(other.vertexB) && this.vertexB.equals(other.vertexA))
         );
killedBy: graph.deleteEdge(e) undirected edges edge list is correct removes the edge a <-> b and receives the correct edge count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] LogicalOperator
models/Edge/UndirectedEdge/UndirectedEdge.ts:24:14
 
         return (
             (this.vertexA.equals(other.vertexA) && this.vertexB.equals(other.vertexB)) ||
-            (this.vertexA.equals(other.vertexB) && this.vertexB.equals(other.vertexA))
+            (this.vertexA.equals(other.vertexB) || this.vertexB.equals(other.vertexA))
         );
     }
killedBy: graph.deleteEdge(e) undirected edges edge list is correct removes the edge a <-> b and receives the correct edge count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ConditionalExpression
models/Edge/UndirectedEdge/UndirectedEdge.ts:24:14
 
         return (
             (this.vertexA.equals(other.vertexA) && this.vertexB.equals(other.vertexB)) ||
-            (this.vertexA.equals(other.vertexB) && this.vertexB.equals(other.vertexA))
+            (false)
         );
     }
killedBy: graph.deleteEdge(e) undirected edges edge list is correct removes the transposed edge b <-> a and receives the correct edge count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] BlockStatement
models/Edge/UndirectedEdge/UndirectedEdge.ts:28:24
         );
     }
 
-    hashCode(): number {
-        // tslint:disable-next-line:no-bitwise
-        return (this.vertexA.hashCode() << 16) + (this.vertexB.hashCode() << 16);
-    }
+    hashCode(): number {}
 }
 
killedBy: WeightedUndirectedEdge hashCode() differs for the same vertices but different weights
statusReason: Error: expect(received).not.toEqual(expected) // deep equality

Expected: not NaN

[Killed] ArithmeticOperator
models/Edge/UndirectedEdge/UndirectedEdge.ts:30:16
 
     hashCode(): number {
         // tslint:disable-next-line:no-bitwise
-        return (this.vertexA.hashCode() << 16) + (this.vertexB.hashCode() << 16);
+        return (this.vertexA.hashCode() << 16) - (this.vertexB.hashCode() << 16);
     }
 }
killedBy: graph.deleteEdge(e) undirected edges edge list is correct removes the transposed edge b <-> a and receives the correct edge count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3
