[Survived] StringLiteral
models/Edge/WeightedEdges/WeightedDirectedEdge.ts:6:31
 import { Hashable } from '@tgillespie/hash-data-structures';
 
 export class WeightedDirectedEdge<V extends Vertex> extends DirectedEdge<V> implements Weightable {
-    protected _type: string = 'WeightedDirectedEdge';
+    protected _type: string = "";
 
     constructor(vertexA: V, vertexB: V, protected _weight: number) {

[Killed] BlockStatement
models/Edge/WeightedEdges/WeightedDirectedEdge.ts:12:25
         super(vertexA, vertexB);
     }
 
-    getWeight(): number {
-        return this._weight;
-    }
+    getWeight(): number {}
 
     equals(other: Hashable): boolean {
killedBy: WeightedDirectedEdge construct and getWeight() for weight of -9007199254740992
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: -9007199254740992
Received: undefined

[Killed] BlockStatement
models/Edge/WeightedEdges/WeightedDirectedEdge.ts:16:38
         return this._weight;
     }
 
-    equals(other: Hashable): boolean {
-        if (!(other instanceof WeightedDirectedEdge)) return false;
-        if (this._type !== other._type) return false;
-
-        return this.isEqualWeightedDirectedEdge(other);
-    }
+    equals(other: Hashable): boolean {}
 
     protected isEqualWeightedDirectedEdge(other: WeightedDirectedEdge<V>): boolean {
killedBy: WeightedDirectedEdge equals() returns false for a directed edge (symmetric)
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: undefined

[Killed] BooleanLiteral
models/Edge/WeightedEdges/WeightedDirectedEdge.ts:17:62
     }
 
     equals(other: Hashable): boolean {
-        if (!(other instanceof WeightedDirectedEdge)) return false;
+        if (!(other instanceof WeightedDirectedEdge)) return true;
         if (this._type !== other._type) return false;
 
killedBy: WeightedDirectedEdge equals() returns false for a directed edge (symmetric)
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] ConditionalExpression
models/Edge/WeightedEdges/WeightedDirectedEdge.ts:17:13
     }
 
     equals(other: Hashable): boolean {
-        if (!(other instanceof WeightedDirectedEdge)) return false;
+        if (true) return false;
         if (this._type !== other._type) return false;
 
killedBy: graph.deleteEdge(e) Reproduce #24 2x WeightedDirectedEdges (opposite direction, not equal) delete 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] ConditionalExpression
models/Edge/WeightedEdges/WeightedDirectedEdge.ts:18:13
 
     equals(other: Hashable): boolean {
         if (!(other instanceof WeightedDirectedEdge)) return false;
-        if (this._type !== other._type) return false;
+        if (true) return false;
 
         return this.isEqualWeightedDirectedEdge(other);
killedBy: graph.deleteEdge(e) Reproduce #24 2x WeightedDirectedEdges (opposite direction, not equal) delete 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] ConditionalExpression
models/Edge/WeightedEdges/WeightedDirectedEdge.ts:18:13
 
     equals(other: Hashable): boolean {
         if (!(other instanceof WeightedDirectedEdge)) return false;
-        if (this._type !== other._type) return false;
+        if (false) return false;
 
         return this.isEqualWeightedDirectedEdge(other);
killedBy: WeightedDirectedEdge equals() returns false when the _type is changed
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] BlockStatement
models/Edge/WeightedEdges/WeightedDirectedEdge.ts:23:84
         return this.isEqualWeightedDirectedEdge(other);
     }
 
-    protected isEqualWeightedDirectedEdge(other: WeightedDirectedEdge<V>): boolean {
-        return this.getWeight() === other.getWeight() && super.isEqualDirectedEdge(other);
-    }
+    protected isEqualWeightedDirectedEdge(other: WeightedDirectedEdge<V>): boolean {}
 
     hashCode(): number {
killedBy: graph.deleteEdge(e) Reproduce #24 2x WeightedDirectedEdges (opposite direction, not equal) delete 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] ConditionalExpression
models/Edge/WeightedEdges/WeightedDirectedEdge.ts:24:16
     }
 
     protected isEqualWeightedDirectedEdge(other: WeightedDirectedEdge<V>): boolean {
-        return this.getWeight() === other.getWeight() && super.isEqualDirectedEdge(other);
+        return false;
     }
 
killedBy: graph.deleteEdge(e) Reproduce #24 2x WeightedDirectedEdges (opposite direction, not equal) delete 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] ConditionalExpression
models/Edge/WeightedEdges/WeightedDirectedEdge.ts:24:16
     }
 
     protected isEqualWeightedDirectedEdge(other: WeightedDirectedEdge<V>): boolean {
-        return this.getWeight() === other.getWeight() && super.isEqualDirectedEdge(other);
+        return true;
     }
 
killedBy: WeightedDirectedEdge equals() returns false for a different weights
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] BlockStatement
models/Edge/WeightedEdges/WeightedDirectedEdge.ts:27:24
         return this.getWeight() === other.getWeight() && super.isEqualDirectedEdge(other);
     }
 
-    hashCode(): number {
-        return super.hashCode() * 2 + this.getWeight();
-    }
+    hashCode(): number {}
 }
 
killedBy: WeightedDirectedEdge hashCode() differs for the same vertices but different weights
statusReason: Error: expect(received).not.toEqual(expected) // deep equality

Expected: not undefined

[Survived] ArithmeticOperator
models/Edge/WeightedEdges/WeightedDirectedEdge.ts:28:16
     }
 
     hashCode(): number {
-        return super.hashCode() * 2 + this.getWeight();
+        return super.hashCode() / 2 + this.getWeight();
     }
 }

[Survived] ArithmeticOperator
models/Edge/WeightedEdges/WeightedDirectedEdge.ts:28:16
     }
 
     hashCode(): number {
-        return super.hashCode() * 2 + this.getWeight();
+        return super.hashCode() * 2 - this.getWeight();
     }
 }
