[Killed] BlockStatement
models/Edge/WeightedEdges/WeightedUndirectedEdge.ts:16:38
         return this._weight;
     }
 
-    equals(other: Hashable): boolean {
-        if (!(other instanceof WeightedUndirectedEdge)) return false;
-        if (this._type !== other._type) return false;
-
-        return this.isEqualWeightedUndirectedEdge(other);
-    }
+    equals(other: Hashable): boolean {}
 
     protected isEqualWeightedUndirectedEdge(other: WeightedUndirectedEdge<V>): boolean {
killedBy: WeightedDirectedEdge equals() returns false for a WeightedDirectedEdge with the same weight
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: undefined

[Killed] BooleanLiteral
models/Edge/WeightedEdges/WeightedUndirectedEdge.ts:17:64
     }
 
     equals(other: Hashable): boolean {
-        if (!(other instanceof WeightedUndirectedEdge)) return false;
+        if (!(other instanceof WeightedUndirectedEdge)) return true;
         if (this._type !== other._type) return false;
 
killedBy: WeightedUndirectedEdge equals() returns false for a undirected edge (symmetric)
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] ConditionalExpression
models/Edge/WeightedEdges/WeightedUndirectedEdge.ts:17:13
     }
 
     equals(other: Hashable): boolean {
-        if (!(other instanceof WeightedUndirectedEdge)) return false;
+        if (true) return false;
         if (this._type !== other._type) return false;
 
killedBy: WeightedUndirectedEdge equals() returns true for its inverse
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BooleanLiteral
models/Edge/WeightedEdges/WeightedUndirectedEdge.ts:18:48
 
     equals(other: Hashable): boolean {
         if (!(other instanceof WeightedUndirectedEdge)) return false;
-        if (this._type !== other._type) return false;
+        if (this._type !== other._type) return true;
 
         return this.isEqualWeightedUndirectedEdge(other);
killedBy: WeightedUndirectedEdge equals() returns false when the _type is changed
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] ConditionalExpression
models/Edge/WeightedEdges/WeightedUndirectedEdge.ts:18:13
 
     equals(other: Hashable): boolean {
         if (!(other instanceof WeightedUndirectedEdge)) return false;
-        if (this._type !== other._type) return false;
+        if (false) return false;
 
         return this.isEqualWeightedUndirectedEdge(other);
killedBy: WeightedUndirectedEdge equals() returns false when the _type is changed
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] BlockStatement
models/Edge/WeightedEdges/WeightedUndirectedEdge.ts:23:88
         return this.isEqualWeightedUndirectedEdge(other);
     }
 
-    protected isEqualWeightedUndirectedEdge(other: WeightedUndirectedEdge<V>): boolean {
-        return this.getWeight() === other.getWeight() && super.isEqualUndirectedEdge(other);
-    }
+    protected isEqualWeightedUndirectedEdge(other: WeightedUndirectedEdge<V>): boolean {}
 
     hashCode(): number {
killedBy: WeightedUndirectedEdge equals() returns false for a different weights
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: undefined

[Killed] ConditionalExpression
models/Edge/WeightedEdges/WeightedUndirectedEdge.ts:24:16
     }
 
     protected isEqualWeightedUndirectedEdge(other: WeightedUndirectedEdge<V>): boolean {
-        return this.getWeight() === other.getWeight() && super.isEqualUndirectedEdge(other);
+        return false;
     }
 
killedBy: graph.deleteEdge(e) Reproduce #24 2x WeightedUndirectedEdges (not equal) delete both
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] ConditionalExpression
models/Edge/WeightedEdges/WeightedUndirectedEdge.ts:24:16
     }
 
     protected isEqualWeightedUndirectedEdge(other: WeightedUndirectedEdge<V>): boolean {
-        return this.getWeight() === other.getWeight() && super.isEqualUndirectedEdge(other);
+        return true;
     }
 
killedBy: WeightedUndirectedEdge equals() returns false for a different weights
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true
