[Killed] BooleanLiteral
src/models/Matrix/AdjacencyMatrix.ts:7:15
 
 export class AdjacencyMatrix<V extends Vertex> extends Matrix<V, V, boolean> {
     constructor() {
-        super(false);
+        super(true);
     }
 
killedBy: graph.deleteEdge(e) directed edges graph is initially as expected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/models/Matrix/AdjacencyMatrix.ts:10:100
         super(false);
     }
 
-    static fromEdgeList<EV extends Vertex, E extends Edge<EV>>(edgeList: E[]): AdjacencyMatrix<EV> {
-        const matrix: AdjacencyMatrix<EV> = new AdjacencyMatrix();
-
-        edgeList.forEach((edge) => {
-            matrix.set(edge.vertexA, edge.vertexB, true);
-            if (!edge.isDirected()) {
-                matrix.set(edge.vertexB, edge.vertexA, true);
-            }
-        });
-
-        return matrix;
-    }
+    static fromEdgeList<EV extends Vertex, E extends Edge<EV>>(edgeList: E[]): AdjacencyMatrix<EV> {}
 
     deleteVertex(vertex: V) {
killedBy: g.transpose() Normal Cases Adjacency matrix is correct after transposing
statusReason: TypeError: Cannot read properties of undefined (reading 'get')

[Killed] BlockStatement
src/models/Matrix/AdjacencyMatrix.ts:13:36
     static fromEdgeList<EV extends Vertex, E extends Edge<EV>>(edgeList: E[]): AdjacencyMatrix<EV> {
         const matrix: AdjacencyMatrix<EV> = new AdjacencyMatrix();
 
-        edgeList.forEach((edge) => {
-            matrix.set(edge.vertexA, edge.vertexB, true);
-            if (!edge.isDirected()) {
-                matrix.set(edge.vertexB, edge.vertexA, true);
-            }
-        });
+        edgeList.forEach((edge) => {});
 
         return matrix;
killedBy: g.transpose() Normal Cases Adjacency matrix is correct after transposing
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/models/Matrix/AdjacencyMatrix.ts:14:52
         const matrix: AdjacencyMatrix<EV> = new AdjacencyMatrix();
 
         edgeList.forEach((edge) => {
-            matrix.set(edge.vertexA, edge.vertexB, true);
+            matrix.set(edge.vertexA, edge.vertexB, false);
             if (!edge.isDirected()) {
                 matrix.set(edge.vertexB, edge.vertexA, true);
killedBy: g.transpose() Normal Cases Adjacency matrix is correct after transposing
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/models/Matrix/AdjacencyMatrix.ts:15:17
 
         edgeList.forEach((edge) => {
             matrix.set(edge.vertexA, edge.vertexB, true);
-            if (!edge.isDirected()) {
+            if (true) {
                 matrix.set(edge.vertexB, edge.vertexA, true);
             }
killedBy: g.transpose() Normal Cases Adjacency matrix is correct after transposing
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/models/Matrix/AdjacencyMatrix.ts:15:17
 
         edgeList.forEach((edge) => {
             matrix.set(edge.vertexA, edge.vertexB, true);
-            if (!edge.isDirected()) {
+            if (false) {
                 matrix.set(edge.vertexB, edge.vertexA, true);
             }
killedBy: g.transpose() Normal Cases Adjacency matrix is correct after transposing
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/models/Matrix/AdjacencyMatrix.ts:16:56
         edgeList.forEach((edge) => {
             matrix.set(edge.vertexA, edge.vertexB, true);
             if (!edge.isDirected()) {
-                matrix.set(edge.vertexB, edge.vertexA, true);
+                matrix.set(edge.vertexB, edge.vertexA, false);
             }
         });
killedBy: g.transpose() Normal Cases Adjacency matrix is correct after transposing
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BlockStatement
src/models/Matrix/AdjacencyMatrix.ts:23:29
         return matrix;
     }
 
-    deleteVertex(vertex: V) {
-        this.deleteRow(vertex);
-        this.deleteColumn(vertex);
-    }
+    deleteVertex(vertex: V) {}
 }
 
killedBy: graph.deleteVertex(v) adjacencyMatrix is correct removes the vertex a and the matrix shows false for whenever %s is the first value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
