[Killed] BlockStatement
src/models/Matrix/Matrix.ts:7:52
     defaultValue: ValueType;
     matrix: MutableHashMap<RowType, MutableHashMap<ColumnType, ValueType>> = new MutableHashMap();
 
-    protected constructor(defaultValue: ValueType) {
-        this.defaultValue = defaultValue;
-    }
+    protected constructor(defaultValue: ValueType) {}
 
     set(row: RowType, column: ColumnType, value: ValueType): void {
killedBy: graph.deleteEdge(e) directed edges graph is initially as expected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] BlockStatement
src/models/Matrix/Matrix.ts:11:67
         this.defaultValue = defaultValue;
     }
 
-    set(row: RowType, column: ColumnType, value: ValueType): void {
-        if (!this.matrix.has(row)) this.matrix.set(row, new MutableHashMap());
-
-        this.matrix.get(row)!.set(column, value);
-    }
+    set(row: RowType, column: ColumnType, value: ValueType): void {}
 
     get(row: RowType, column: ColumnType): ValueType {
killedBy: graph.deleteVertex(v) graph is initially as expected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/models/Matrix/Matrix.ts:12:13
     }
 
     set(row: RowType, column: ColumnType, value: ValueType): void {
-        if (!this.matrix.has(row)) this.matrix.set(row, new MutableHashMap());
+        if (this.matrix.has(row)) this.matrix.set(row, new MutableHashMap());
 
         this.matrix.get(row)!.set(column, value);
killedBy: graph.deleteVertex(v) graph is initially as expected
statusReason: TypeError: Cannot read properties of undefined (reading 'set')

[Killed] ConditionalExpression
src/models/Matrix/Matrix.ts:12:13
     }
 
     set(row: RowType, column: ColumnType, value: ValueType): void {
-        if (!this.matrix.has(row)) this.matrix.set(row, new MutableHashMap());
+        if (true) this.matrix.set(row, new MutableHashMap());
 
         this.matrix.get(row)!.set(column, value);
killedBy: graph.deleteEdge(e) directed edges graph is initially as expected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/models/Matrix/Matrix.ts:17:54
         this.matrix.get(row)!.set(column, value);
     }
 
-    get(row: RowType, column: ColumnType): ValueType {
-        const rowData = this.matrix.get(row);
-        if (rowData === undefined) return this.defaultValue;
-
-        const cellData = rowData.get(column);
-        if (cellData === undefined) return this.defaultValue;
-
-        return cellData;
-    }
+    get(row: RowType, column: ColumnType): ValueType {}
 
     deleteRow(row: RowType): void {
killedBy: graph.deleteEdge(e) directed edges graph is initially as expected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] EqualityOperator
src/models/Matrix/Matrix.ts:19:13
 
     get(row: RowType, column: ColumnType): ValueType {
         const rowData = this.matrix.get(row);
-        if (rowData === undefined) return this.defaultValue;
+        if (rowData !== undefined) return this.defaultValue;
 
         const cellData = rowData.get(column);
killedBy: graph.deleteEdge(e) directed edges graph is initially as expected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/models/Matrix/Matrix.ts:19:13
 
     get(row: RowType, column: ColumnType): ValueType {
         const rowData = this.matrix.get(row);
-        if (rowData === undefined) return this.defaultValue;
+        if (true) return this.defaultValue;
 
         const cellData = rowData.get(column);
killedBy: graph.deleteEdge(e) directed edges graph is initially as expected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/models/Matrix/Matrix.ts:22:13
         if (rowData === undefined) return this.defaultValue;
 
         const cellData = rowData.get(column);
-        if (cellData === undefined) return this.defaultValue;
+        if (false) return this.defaultValue;
 
         return cellData;
killedBy: graph.deleteEdge(e) directed edges graph is initially as expected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] ConditionalExpression
src/models/Matrix/Matrix.ts:22:13
         if (rowData === undefined) return this.defaultValue;
 
         const cellData = rowData.get(column);
-        if (cellData === undefined) return this.defaultValue;
+        if (true) return this.defaultValue;
 
         return cellData;
killedBy: g.getChildNodes(v) Normal Cases Graph has more edges than vertices Works correctly with a directed Graph
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   NamedVertex {
-     "name": "b",

[Killed] BlockStatement
src/models/Matrix/Matrix.ts:27:35
         return cellData;
     }
 
-    deleteRow(row: RowType): void {
-        this.matrix.delete(row);
-    }
+    deleteRow(row: RowType): void {}
 
     deleteColumn(column: ColumnType) {
killedBy: graph.deleteVertex(v) adjacencyMatrix is correct removes the vertex a and the matrix shows false for whenever %s is the first value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/models/Matrix/Matrix.ts:31:38
         this.matrix.delete(row);
     }
 
-    deleteColumn(column: ColumnType) {
-        for (const row of this.matrix.values()) {
-            row.delete(column);
-        }
-    }
+    deleteColumn(column: ColumnType) {}
 }
 
killedBy: graph.deleteVertex(v) adjacencyMatrix is correct removes the vertex b and the matrix shows false for whenever %s is the second value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/models/Matrix/Matrix.ts:32:49
     }
 
     deleteColumn(column: ColumnType) {
-        for (const row of this.matrix.values()) {
-            row.delete(column);
-        }
+        for (const row of this.matrix.values()) {}
     }
 }
killedBy: graph.deleteVertex(v) adjacencyMatrix is correct removes the vertex b and the matrix shows false for whenever %s is the second value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
