[Killed] BlockStatement
models/Vertex/NamedVertex/NamedVertex.ts:12:36
         this.name = name;
     }
 
-    compareTo(other: this): number {
-        return this.name.localeCompare(other.name);
-    }
+    compareTo(other: this): number {}
 
     equals(other: any): boolean {
killedBy: graph.deleteVertex(v) graph is initially as expected
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    NamedVertex {
-     "name": "a",

[Timeout] BlockStatement
models/Vertex/NamedVertex/NamedVertex.ts:16:33
         return this.name.localeCompare(other.name);
     }
 
-    equals(other: any): boolean {
-        return other instanceof NamedVertex && this.name === other.name;
-    }
+    equals(other: any): boolean {}
 
     hashCode(): number {

[Timeout] ConditionalExpression
models/Vertex/NamedVertex/NamedVertex.ts:17:16
     }
 
     equals(other: any): boolean {
-        return other instanceof NamedVertex && this.name === other.name;
+        return false;
     }
 

[Timeout] EqualityOperator
models/Vertex/NamedVertex/NamedVertex.ts:17:48
     }
 
     equals(other: any): boolean {
-        return other instanceof NamedVertex && this.name === other.name;
+        return other instanceof NamedVertex && this.name !== other.name;
     }
 

[Killed] BlockStatement
models/Vertex/NamedVertex/NamedVertex.ts:20:24
         return other instanceof NamedVertex && this.name === other.name;
     }
 
-    hashCode(): number {
-        return stringToHashCode(this.name);
-    }
+    hashCode(): number {}
 }
 
killedBy: WeightedUndirectedEdge hashCode() differs from the DirectedEdge with weight of 0
statusReason: Error: expect(received).not.toEqual(expected) // deep equality

Expected: not 0
