[Survived] ArrowFunction
models/Vertex/Vertex/Vertex.ts:10:28
     abstract hashCode(): number;
 }
 
-export const vertexEqual = <V extends Vertex>(a: V, b: V): boolean => a.equals(b);
+export const vertexEqual = () => undefined;
 
 export const vertexCompareTo = <V extends Vertex>(a: V, b: V): number => a.compareTo(b);

[Killed] ArrowFunction
models/Vertex/Vertex/Vertex.ts:12:32
 
 export const vertexEqual = <V extends Vertex>(a: V, b: V): boolean => a.equals(b);
 
-export const vertexCompareTo = <V extends Vertex>(a: V, b: V): number => a.compareTo(b);
+export const vertexCompareTo = () => undefined;
 
killedBy: graph.deleteEdge(e) directed edges graph is initially as expected
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    NamedVertex {
-     "name": "a",
